[{"name":"thattraveler\n","description":"Pricy but an amazing machine. Hard to compare it to competitors by just numbers. Yeah, larger heavier laptops will perform better with the same specs, but you wont notice that in game.\nAt the moment there seems to be a \"glitch\"? making the cpu perform better if set in optimus. Highest time spy score was a bit over 17000. Ridiculous numbers for a gaming ultrabook.\nFor best results, until possible updates fix this strange interaction-\n-optimus display mode\n-gsync in full screen only\n-I use ghelper and disable asus background services (look in \"extra\" on ghelper, turn them back on if you want to check for updates through myasus) just having those services running seemed to drop cpu time spy score back into mid 11000s\n-cpu boost efficient aggressive\n-150\/250 overclock on gpu (set in armory crate or ghelper)\n\ncpu score in time spy went from 11300-11600 to 12300-12800+\n\nIMO having to have such specific settings to get the best performance is odd... considering they don't seem to have anything to do with each other. but that's the secret sauce for now until it gets addressed.\n\n10\/10 though. definitely recommend if you have the funds.\n","rating value":4.36},{"name":"CompMan\n","description":"Expensive but well worth it. \n\nEverything about it is awesome. Well worth the money and $1000 cheaper than the Blade 16 oled with the same specs. \n\nAlso, the 4090 has a TGP of 125 watts. \n\nI Set the world record in time spy for the time being. See attached pic.\n","rating value":4.2},{"name":"Kirtan\n","description":"Decent buy. Was really confused between buying a powerful gaming laptop that I can use for school also. After comprehensive research, this laptop was my ultimate choice! Performance wise, it’s not disappointing at all. Laptop does get hot like lava while gaming( I guess investing in a cooling pad would be worth it). The display is spectacular. Sound quality also excellent. It is a beast. It does slow down on me sometimes, but I guess these are machines- so they’re bound to limited tasks. G14 would have been really small for me. This is the perfect size!\n","rating value":3.2222222222},{"name":"Anonymous\n","description":"I have got the laptop for a solid month now and coming from a MacBook Pro for 10+ years, this is everything I hoped for in a windows laptop. Insanely powerful plugged in, excellent battery life on Eco + Silent Mode using GHelper (7h to 9h), no fan noise and gorgeous display and build quality. Can't recommend it enough. As for gaming, getting 70+FPS on max settings for Alan Wake 2 in one of the most demanding areas (Coffe World) at QHD and Frame Gen says everything you need to know.\n","rating value":4.5},{"name":"RobertM\n","description":"Throughly impressed straight out of the box. The sleek look was something im not used to in a gaming laptop. This slim machine packs more hardware than my older gaming laptop. It was a very nice upgrade and this laptop has more than enough power and memory to run all of my games in my current gaming library. The storage was another reason I purchased this machine. I had to have all of my games on an external hard drive with my previous laptop so its nice not to worry about carrying around extra storage.\n","rating value":3.8571428571},{"name":"Steve\n","description":"Excellent laptop, Beautiful design, truly adds a professional design to a real powerhouse laptop. With some minor tweaks I've passed 13 hours of battery and no noticable performance loss. Worth the price for what you get, design matters more than I thought\n","rating value":5.0},{"name":"IgnasioP\n","description":"The PC works very well, it is fast and the performance is excellent\n","rating value":5.0},{"name":"Henry\n","description":"What a great laptop... Thin, Light, but Ppowerful. (Score run in turbo mode, might be higher if you manual, but noise gonna be too loud. )\n","rating value":0.0},{"name":"Mitsu\n","description":"Bought an open box, only has a 1TB drive, not 2TB. Did someone pull a fast one? Will return oh well…\n","rating value":3.0},{"name":"Tolley\n","description":"This is a beast of a computer. It’s packed with top-tier specs yet doesn’t look like a spaceship with RGB everywhere, so you can use it in the boardroom or your basement and it won’t look out of place. This is my first Asus PC and so far, I’m impressed. The build quality is outstanding. The case itself feels premium, which is always a good first impression. I’m glad to see gaming PCs are finally moving away from plastic, and Asus did it right with this machine. Fan vents downward at the back vents...fine, but make sure you pay attention to the surface you have the computer on.\n\nOn both sides are pretty standard, consisting of a power, HDMI, USB-C\/\/Thunderbolt, USB-A, headphone jack on the left, SD reader, USB-A, USB-C\/\/Thunderbolt on the right. You can charge using USB-PD, so if you forget your power supply, you can charge it with a high-power USB-C charger. There are no ports on the rear except for lots of vents (more on that later). It’s a sleek design and the diagonal LED on the lid is fine…you can turn it off or have it do patterns, etc. I don’t ever see it, so I don’t care, but if you want to customize the pattern, you can. These lid lights are pure white and not RGB. I consider that a good thing.\n\nYou can lift the lid with a single finger without the base popping a wheelie. This adds no actual functionality, but it’s a nice testament to the engineers at Asus. The keyboard, while crisp and quiet, is above average, but it’s no Thinkpad keyboard. The trackpad is large, glass and accurate, if not a little too big. I am getting too many accidental presses and mouse motion due to the trackpad size...there isn't really anywhere to rest your wrists since the trackpad takes up so much space. Hopefully Asus' palm-rejection software can be improved in the future.\n\nThe display is as jaw-dropping, as you'd expect. It's very bright and is essentially a flawless OLED panel. The resolution is perfect for the size. I have no complaints about the screen whatsoever. It’s not a touch-screen, but that’s a good thing on a gaming laptop.\n\nThe speakers were a pleasant surprise; they are seriously 90% as good as the MacBook Pro 16\" speakers, which are amazingly full from highs to lows. I've owned a few other gaming laptops in the past and all of them had the typical tinny sounding speakers that nobody likes. These are legit and I'd feel confident saying they will likely impress you too.\n\nIt has the latest Intel Core Ultra 9 processor along with Nvidia RTX 4090. Needless to say, the gaming performance is impressive. Every game I’ve tried looks and runs smooth. Remember the rear vents I mentioned earlier? Well, in order to eliminate hot air blowing out of the sides and back of the computer, the fans blow back and down out of the rear vents. It does a nice job of hiding the blasting hot air when gaming, but you have to be careful about what surface you have it sitting on. I have a plastic desk mat and I didn’t realize the hot air was blowing directly on the desk surface, so much so that the heat warped my plastic mat! I can see it being actually painful to use on your lap, so you may want to get a desk laptop cooler or pad so it raises up, lowering the temperature of the heat that’s blasting your desk.\n\nOverall, I’m very happy with it. Gaming is solid, the audio is impressive, and the OLED screen is amazing. If I were to give it a score out of 10, I’d comfortably put it at an 8\/10. The rear downward blowing vents are kind of a bummer since I think the more logical way to expel heat is straight out the back and rear sides. I do see why they designed it like that, however, as the physical profile\/footprint of this computer is really nice looking. It’s definitely an expensive laptop, but if you want the best, it’s worth the price, IMO.\n","rating value":3.6666666667},{"name":"dustinw\n","description":"I think you would be hard pressed to find a better gaming laptop that is currently on the market. This laptop is absolutely stacked with features, including some that aren't readily available anywhere else, like the OLED screen. The screen is truly impressive. With its native resolution of 2560x1600, it's very sharp, but being an OLED screen, the contrast, color reproduction and viewing angles all benefit and far surpass its competition. Then, you add the ability to use up to 240Hz refresh rates, and you can see how special this laptop is already. Using the screen is an absolute pleasure. This combined with the performance and design, makes this laptop an equally good choice for creatives. \n\nAs someone who's daily work uses Adobe's suite of products (Photoshop, Premiere, After Effects, Illustrator), along with 3D rendering software which includes Blender and other tools, gaming machines are often the best machines to use for my variety of work. It's refreshing to see a laptop that is clearly a gaming laptop in spec and capability, but its design makes it welcome for professional use too. The color reproduction also helps in this area, as the screen has very accurate color. The outer casing of the laptop looks sleek, the slash is a subtle, and nice touch. The lighting can be disabled if you find it distracting. It doesn't gather lots of fingerprints either. Its weight isn't overly heavy either. ASUS has managed to check nearly every possible box.\n\nOf course, I also do a lot of gaming, and the laptop does not disappoint here either. I have ran benchmarks in some of the more demanding games, or ones that have good benchmarking tools so I could share my results. Needless to say, this laptop handled everything I threw at it without much trouble. I'll start with probably one of the most demanding tests, Cyberpunk 2077. Using its Overdrive Ray Tracing mode will bring many machines to their knees. If you're playing using the OLED screen on the laptop at 2160x1600 resolution, you can easily get 60 FPS utilizing Nvidia's frame generation. As I often game on my TV or Monitor. I connected the laptop to those to push it harder at 4k for most of my testing. Cyberpunk, still using its overdrive ray tracing and ultra settings was able to run at 45-50 FPS, which is truly impressive. When using a VRR display, this makes for a very playable and incredible looking experience. This was by far the hardest test for this laptop, and I'd say it was a huge win. With minor tweaks, you could be running at 60 FPS easily. Or if you're using the laptop's OLED screen, you wouldn't have to do any tweaks and just play it maxed out. Other games were easily maxed out as well. Forza Horizon 5 is another game I like to use for testing, since its benchmark tool usually shows any weak points as well. Forza Horizon 5 was a locked 60 FPS at 4K. I imagine you could easily run at higher framerates on the laptop's screen as well. I also tested using Gears 5. It's a bit older game, but it has a great benchmarking tool, and it helps to show just how well this laptop performs. It easily pushed 60 FPS at 4k with every setting maxed. I'm positive it could push higher framerates too. I also wanted to mention that all these tests were utilizing ASUS's Armory Crate software to dial in the performance of the laptop. I used the \"Ultimate\" GPU setting and the \"Performance\" CPU setting. You could likely squeeze out even more performance by switching the CPU to use the \"Turbo\" setting. I liked to keep the laptop on the \"Performance\" setting, since the fan didn't have to work as hard while using the \"Performance\" setting. This laptop has the capability to be your gaming machine for quite some time.\n\nIf you are in the market for a high-end gaming or creative laptop, this laptop easily handles both. Its performance combined with an incredible OLED screen make it an easy choice. It's clear a lot of thought has gone into the design of this laptop as well. While you can charge using a USB, that won't quite provide enough power if you're trying to game on it as well. Using the included charger will allow you fully utilize the machine, and while it may seem like a minor feature, it's one that I really like. The plug for the laptop is reversible, sort of a like a USB 3 cable. There's no fumbling trying to figure out which way to plug it in. My only minor complaint is that there is no ethernet port. Not a deal breaker, since you could use a USB hub to utilize one, but it would be nice to have on the laptop itself.\n\nPros: Incredible Performance, Beautiful Screen, Well Designed, Good Battery Life, Compact and lightweight for a gaming laptop\nCons: No built in ethernet port\n","rating value":4.2558139535},{"name":"Technopackrat\n","description":"The new ASUS ROG Zephyrus G16 has been much anticipated and I was watching the tech world with the first hands on during CES2024.   I watched as many of those first glance videos as I could and it didn’t take long for me to decide that I had to get one.\n\nThe form factor shaved off a bit of thickness and weight from previous year models and I was never a huge fan of all the LEDs on the top of the screen lid so the more subtle slash is much more appealing making this laptop something I would even take to a business meeting and after hours get my game on.\n\nThe specs are outstanding.  Sporting the newest Intel Ultra 9 CPU and a RTX4090 GPU gives it a ton of horsepower under the lid.  Add 32GB of DDR5 ram and a 2TB NVME SSD you are tacking on some serious memory and storage.   While the memory is soldered in as a compromise to get the thinner profile it does help offset that with an extra NVME slot so you can add additional storage for more gaming fun.\n\nThe OLED screen is super crisp and the high refresh rate make for a super sharp display.  I did run into a bit of tearing while watching Youtube videos at full screen but upgrading to the latest drivers corrected most of that.  With HDR enabled the colors pop! \n\nWhile playing Tom Clancy’s Division 2,  my favorite FPS game for years, with  graphic settings at High and Ultra for most everything I got a wide variety of frame rates.  They  jumped all over the place but never below 60 frames per second while mostly running around 75-120 depending on the complexity of the graphics.  I did notice a bit of performance throttling but all within expectations.   \n\nWhen I connected to a 34” ultrawide monitor via HDMI while playing Division 2 I noticed that the frame rate held to only 60 frames per second, constantly.  With same settings as before… High, Very High and Ultra High graphics.  It wouldn’t budge above 61 FPS.  Game play was smooth but somehow I expected more from a RTX4090.  I’ll have to dig further to see if there are any settings I can make to the hardware to unleash the potential.\n\nI didn’t time battery life but gaming isn’t something I’d do on battery power.  I’ll take the power brick with me for gaming but even my CAD workstation can’t go untethered for too long.\n\nNow for some of the not so good… fan noise during game play got pretty loud.  It was noticeable and if not playing with a headset it my become annoying.  The one thing that bothered me most was the temperatures.  The fans were doing their best to keep the temps down and I can live with some of the fan noise but the thing that bothered me most was the skin temps.  Either side of the keyboard and the space between the keyboard and the screen were too hot to touch with temps on that section between the keyboard and screen running at a high of 133 deg F, give or take a few decimals of degrees.  Underneath the temps were pretty high too so it might be that the laptop isn’t really ready to be a laptop but a more like a very portable workstation.   Once I exited the game temps dropped pretty quickly to around 100 deg F so just a tad over normal body temps.   To help with the temps down I had to break out a tabletop laptop cooler which did help some but the cooler is not something I’d toss in my laptop bag.\n\nAn observation of why temps might be so high with the lid open.  As the lid comes up it partially blocks the heatpipe fan exhaust port that runs across the rear of the laptop.  Maybe it just redirects it down more but it does seem to create an airflow restriction in my opinion.  I did notice temps drop just a slight bit while playing with an external monitor and lid closed… but only slightly so this may not be as big of a deal as I would suspect.\n\nThe price tag is a bit steep but you pay for the specs and performance and it’s actually competitively priced against similar spec’d units by the other guys.  I’m a huge ASUS fan and always recommend laptops and components to my friends and family.  Other than the temps and the somewhat disappointing frame rates (with acceptable game play) considering this is a 4090 I think ASUS is continuing to prove they are leaders of the pack.  Hopefully new drivers will help with temps and frame rates.\n","rating value":3.9565217391},{"name":"Dragonhunter281\n","description":"For computer enthusiasts, most will recognize that top end hardware will naturally come with a significant cost. Naturally, the absolute best computer will always disregard price in favor of cutting-edge performance. Without budget restrictions, the performance should be impressive. Thus, as a part of the ROG line of products, the recently released Asus Zephyrus GU605M aims to provide top end performance, while preserving a compact package. Furthermore, the GU605M features an Intel Ultra 9 185H processor, an Nvidia GeForce GTX 4090 GPU, 32GB of DDR5-7467 MHz, and a 2 TB PCIe 4.0 M2 SSD. Thus, with top end hardware, I was excited to see how the new GU605 performs in real world scenarios.\n \nFor the physical aspects, the aluminum based GU605 is exquisite to look at and hold. The body is smooth to the touch and has impeccable craftsmanship. The GU605 clocks in around 4lbs in weight, which is quite shocking considering the hardware it houses. On the left side of the unit, the GU605 features a proprietary reversable connection for the included 240W AC adapter. In addition, the unit features an HDMI 2.1b, a Thunderbolt 4 port, two USB 3.2 Gen ports, a USB 3.2 Type-C port, and lastly a full speed UHS-II SD card reader. Another interesting aspect of the GU605 is the charging and hardware activity LEDs have been moved to the front. On the top of the display is the new slash design with customizable patterns; however, the LED is limited to only white. Moving on, the GU605 features an amazing OLED display that is capable of 240 Hz and has a response time of 0.2ms. The glossy finish looks exquisite with the all-aluminum body. Overall, I think most will be pleased the various connectivity options presented here.\n\nBefore moving on to my performance benchmarks, I would like to mention that as with any piece of electronic equipment, you are going to have to configure a few settings on your own. In addition, my results listed here may be different from your own, though I tried to preserve as close to a stock experience as I could.  As for my changes, I prevented the display and hard drive from clicking off and disabled all the startup executables except the Asus ones. All my tests were done plugged up with its AC adapter. In addition, the turbo profile found in the included Armoury Crate software was used; best performance was also selected in the Windows control panel. I also went ahead and let Window finish all of its updates before I began. Lastly, for monitoring I used a combination of CPU-Z 2.09, GPU-Z 2.57, HW Monitor 1.52, HW Info 7.68, CrystalMark 8.0.4c and Fraps 3.59. \n\nStarting of my benchmarks, I decided to focus on CPU performance and wanted to see how it compared to my other laptops. Using CPU 2.09, I noted the performances below: \n\nUltra 9 185H - Single: 786.6\/ Multi: 9,139.9 (16 Cores \/ 22 Threads)\n\nI7-12700H - Single: 731.0\/ Multi: 7,844.7 (14 Cores \/ 20 Threads)\n\nI7-1360P - Single: 761.7\/ Multi: 6,227.7 (12 Cores \/ 16 Threads)\n\nFor my second CPU test, I went ahead and ran Cinebench R23 and compared it once again to my previous computers:\n\nUltra 9 185H - Single: 1,826\/ Multi: 19,717 (16 Cores \/ 22 Threads)\n\nI7-12700H - Single: 1,761\/ Multi: 15,901 (14 Cores \/ 20 Threads)\n\nI7-1360P - Single: 1,875 \/ Multi: 11,102 (12 Cores \/ 16 Threads)\n\nSwitching to my game test, I decided to test Rise of the Tomb Raider (2016). I ran the game using the very high preset and disabled the film grain and DLSS. The render was set to DX11 and anti-aliasing was set to SSAA 2x. The display was set to the maximum resolution of 2560x1600 and the refresh rate was set to 240Hz. V-Sync was disabled. As soon as the game begin, the 4090 kicked in high gear holding a resounding 75-80 fps. Once the mountain gave way, I dipped right around 60 fps. If you move your character around, naturally the FPS increases dramatically anywhere from the low 70s-130s. Once you get inside the cave, the fps holds more consistently around 80-90 fps. If you increase the SSAA to 4x, the FPS tanks quite a bit; in some instances, dropping into the low 40s. Considering how intense this portion is on the GPU, I was quite impressed. As for the GPU\/CPU, both hovered around 80C and continued to fluctuated accordingly. On GPU-Z, average board power consumption was around 73 watts for the whole game duration. For the whole system, HW Info, reported around 130 watts. Lastly, I ran the in-game benchmark for you to compare with your system (see attached screenshot). \n\nMoving on, I wanted to benchmark the various storage aspects of the new GU605, first starting with the internal drive. According to HW Info, the GU605 includes a 2 TB SK Hynix PC801 SSD (Model: HFS002TEJ9X101N). Using CrystalMark 8.0.4c, the results are as follows:\n \nSequential Read Q8T1: 7,098.69 MB\/s \/ Sequential Write Q8T1: 6,461.79 MB\/s \n     \nSequential Read 4K Q1T1: 67.17 MB\/s \/ Sequential Write 4K Q1T: 147.98 MB\/s\n\nIn addition, I wanted to test this drive with my Crucial X10 Pro using the Thunderbolt 4 port to see how it would handle an intensive transfer. I sent a 34 GB music folder that houses 6,041 files and 1,276 folders. Once I sent the transfer to the Hynix drive, the transfer exploded up to around 700-800 MB\/s. As expected, the transfer was so fast that it barely had time to stretch it legs, but eventually it cracked past the 1.08 GB\/s towards the last 10-15 seconds. It was finished in less than a minute. The X10 results are as follows:\n\nSequential Read Q8T1: 2,038.33 MB\/s \/ Sequential Write Q8T1: 1,803.66 MB\/s  \n    \nSequential Read 4K Q1T1: 27.98 MB\/s \/ Sequential Write 4K Q1T: 80.42 MB\/s\n\nLastly, I was extremely excited that the GU605 comes with a UHS-II SD card reader. I grabbed my Sony Tough G UHS-II 32 GB SD card and sent a mixture of RAW and JPG images to the Hynix drive. The total transfer consisted of 851 files and was 14 GB in size. The transfer was more consistent than expected, as it hovered anywhere from 165-187 MB\/s. It spent most of its time around 175 MB\/s and finished in a little over a minute. Lastly, I took CrystalMark and capture the SD card results below:\n\nSequential Read Q8T1: 278.45 MB\/s \/ Sequential Write Q8T1: 186.94 MB\/s    \n  \nSequential Read 4K Q1T1: 9.82 MB\/s \/ Sequential Write 4K Q1T: 3.39 MB\/s\n\nNext, I would like to highlight is the speakers. As somewhat of an audio enthusiast, I was completely shocked at how loud these speakers get. With four speakers and two tweeters, it certainly packs a punch. In a word, this thing destroys my Yoga 9i which has an amazing soundbar for its size. Listening to my FLAC collection, I was quite surprised at the level bass it was able to reproduce, yet still remaining clear. These are the loudest speaker I have personally heard on a laptop.   \n\nLastly, I would like to share a few of my observations I noticed while testing the new GU605. Overall, the performance is extremely good as expected with a top end model. However, one thing that I was a bit concerned with was the thermal levels as naturally top end hardware will generate lots of heat. Due to its slim profile, the GU605M idles extremely warm, especially when connected to the AC adapter. Once the Ultra 9 takes off, you are looking idle temperatures anywhere from the 60-70C range while it adjusts its frequencies. Furthermore, even after a cold and boot and on the windows preset within the Armoury Crate software, the CPU hits 60C frequently; occasionally it spikes well into the 70s-80s. Naturally, on battery it is a bit better as it cannot boost as much but, nonetheless, I advise you to pay attention to the temperatures. The good news is that you can manually adjust the PL1 and PL2 states within the Armoury Crate software by selecting manual mode accordingly (PL1 is 80w and PL2 is 100w by default for AC power). In addition, you can also disable some of the P-Cores\/E-Cores to curve the excessive heat further. While the software itself feels a bit clunky, it was nevertheless nice to able to control these hardware aspects to customize your hardware.\n\nThe second thing that I wanted to mention is that I wish the OS installation was less bloated. With just the software alone that was included, the GU605M boots at almost 20% of its 32 GB filled. There are tons of ASUS executables that can be disabled, but as you would expect they are all intertwined with the Armoury Crate software. With a model of this caliber, I wish they would have opted for 64 GB of RAM and that the software was only limited to a few startup executables. Granted, since this model is only targeting enthusiasts, chances are high that most will know how to customization\/format the Windows installation. Connectively, I also wish this came with a professional copy of the OS as opposed to the home edition, but nonetheless that can be easily fixed.  \n\nIn conclusion, the GU605M performs exactly as a top model should. Out of the box, it is extremely fast and posts some impressive CPU and GPU scores. The top-notch display and excellent speakers are also a huge plus. Personally, I was extremely impressed with the storage scores, especially the UHS-II SD card reader. The audio was also well implemented; the speakers are loud and clear. However, despite the top end hardware, the GU605 is not without some mild concerns, most notably its excessive idle heat and bloated install. Overall, if you are looking for a top model, the GU605M will certainly check every performance metric box you are hoping to fulfill; just be aware of the concerns that I have listed above.\n","rating value":4.2380952381},{"name":"dorkhead2\n","description":"If you understand what you’re purchasing, you’re going to be happy with this laptop’s features. It’s a very powerful laptop with the latest Intel CPU and NVIDIA graphics card. It can handle all types of demanding tasks from video editing to serious gaming. However, it’s designed with portability in mind by being housed in a lightweight, thin, and high-quality chassis. These features do slightly limit the processing power of the computer, but for many, the trade-off is well worth it. What you’re essentially getting here is a MacBook Pro competitor in looks, quality, and performance, but with the added benefit of high-end gaming. It’s perfect for someone who travels a lot and wants the benefit of both worlds: thin and light, and very powerful.\n\nLike I mentioned, I think it is very important to understand the capabilities of this laptop. First, this system comes with an Intel Core Ultra Processor. This is different than a regular Intel Core Processor (sans the Ultra). While a regular 14th generation Intel Core Processor is designed for higher power (measured in TDP), the same generation Intel Core Ultra processor is designed with slightly less power for more efficiency (longer lasting battery), solid performance, and the introduction of new AI processing units; a perfect combination for on-the-go computing.\n\nAnd like the processor, the GPU within this computer also operates with a slightly lower processing power (measured in TGP). The GPU is part of NVIDIA’s Max-Q design. Max-Q GPUs can run demanding, high-resolution games too. Their design allows a powerful GPU to be placed in thinner computers by providing appropriate heat management. This usually means the computer can operate with less noise from the internal fans.\n\nHopefully with this understanding of CPU and GPU differences, you can determine if this PC is perfect for your needs or wants. To be clear, this laptop can still game with the best of them. It provides great FPS (frames per second) at high settings, depending on the game. For example, while playing Fortnite, with DLSS on, and high-quality settings applied, I was getting about 180 FPS. When dialing down the settings a little, I was getting well over 250 FPS. These are strong numbers for such a thin and light laptop. Even when I plugged in my 32-inch QHD (2560x1440 pixels) external monitor, the laptop stayed around 120 FPS using high quality settings. This is still very good given all the factors previously mentioned.\n\nI found it also important to understand the CPU and GPU settings and how to use them. If anything, these suggestions are more like tips I’ve learned after spending some time with this laptop. If you want to get the most out of gaming, it’s best to know the difference between the settings in ASUS’s system control software, know as Amory Crate, versus NVIDIA’s separate settings in NVIDIA Control Panel. The beauty of this laptop is that it has a MUX switch. A MUX switch is a setting within the computer that allows you to control which GPU is running the laptop’s display. When you’re doing regular tasks like web browsing, it’s best to use the integrated graphics built into the Intel chip. However, when you’re gaming you definitely want the computer to use the discrete graphics card, the NVIDIA RTX 4090. While the former offers power efficiency, the latter offers full power. This is where things can get confusing. Amory Crate offers the ability to change between four GPU modes: Ultimate, Standard, Eco, and Optimized. You can switch to the Ultimate GPU mode, but you’ll have to restart the computer. Afterwards, all your programs, including games, will run on the more powerful GPU. Being able to switch GPU modes is part of the MUX switch feature.\n\nHowever, NVIDIA separately introduced a better way to utilize the MUX switch. Instead of manually changing it in Armory Crate, you can choose a setting in NVIDIA’s Control Panel that will automatically switch between GPUs without the need to restart the computer. This feature is known as Advanced Optimus. And just like everything with computers, don’t get Advanced Optimus confused with Optimus. As you can see in one of my pics, you’ll want to go into NVIDIA’s Control Panel, select Manage Display Mode, and choose the Automatic Select option. This will take care of the switching of GPUs for you. It will recognize when a resource intensive game is starting, and the computer will make the switch automatically to the discrete GPU (see Fortnite pic as an example). With this feature enabled in NVIDIA’s Control Panel, there isn’t a need to do the switching within Amory Crate. It’s best to leave the GPU mode in Amory Crate to Standard. The only time you would want to use Amory Crate’s Ultimate Mode is if you don’t ever want to utilize the internal GPU. This will effectively shut off the internal GPU and everything will run on the discrete GPU. However, this will consume a lot more power and unnecessarily add to your electricity bill, albeit a small amount. So essentially, you have two methods to accomplish the same goal. And since this laptop has the new Advanced Optimus feature, there isn’t a need to choose anything other than the Automatically Select option within NVIDIA’s Control Panel.\n\nOther tips to be noted. For better gaming performance, within Amory Crate, run the CPU mode in the Turbo setting with the power supply plugged in. This will cause the fans to run louder, but if you have a headset on while gaming, you will not notice it. If the fan noise is a concern, you can choose the Performance setting. The fans will not be as loud, but you’ll lose a little computing power. And finally, when you’re doing everyday tasks, use the Silent mode for hardly any noise at all (see pic). \n\nAnother important tip, if you connect an external monitor via USB, be sure to use the USB-C port on the right side of the computer (the side with the SD card reader). Through testing, I found that this port is connected directly to the discrete GPU. If you use the USB-C port on the left side, it only connects to the internal GPU. And when you’re gaming, you’ll want to be utilizing the power of the discrete RTX 4090 GPU, especially if your external monitor supports G-SYNC. If you’re using an HDMI cable, there’s no issue here, the HDMI plug is connected to the discrete GPU. In my case, I needed to use the USB-C port because I was using a specific 8K USB-C to display port cable when connecting my external monitor. As for the laptop’s screen, the internal display automatically switches to the discrete GPU when gaming begins (if the Advanced Optimus option is seleted) (see pic). This allows the laptop to utilize the 240 Hz refresh rate as well as the G-SYNC features built into the OLED display: a first of a kind feature. This is the first time G-SYNC has been coupled with an OLED display on a laptop. Another nice feature of this computer.\n\nThe OLED display itself is beautiful. Like I mentioned earlier, this computer rivals a MacBook Pro. The colors on this display are accurate and the contrast is amazing. Blacks are truly black. My eyes needed to get used to the fine granular detail between different shades of white. Something I never noticed with an LCD display before. And when gaming, the ability to see better in darker scenes is a nice plus too.\n\nI would recommend this laptop to someone that doesn’t want to carry a larger and heavier gaming laptop around. This can work for a student that carries their laptop from place to place, but also wants strong gaming performance. Or this laptop can work for a professional that wants a powerful computer to handle their workload, but also needs something for travel. If you are looking for the most powerful laptop out there, you’ll probably want to look at thicker laptops that allow for powerful fans and heavy cooling. However, if this model and design suits your needs, you will get a lot out of this Intel Core Ultra 9 processor and NVIDIA RTX 4090 graphics card. This is the best CPU and GPU available today. In addition, the 32 GB of RAM will future proof this system for a few years. Unfortunately, the RAM is soldered onto the motherboard and is not upgradeable, but this is another tradeoff that is necessary for a thin, light, and easy to carry laptop. Overall, if you’re willing to sacrifice a little on performance for the benefit of portability, this laptop is a good choice.\n","rating value":4.5675675676},{"name":"Wraith\n","description":"I’m not prone to gush over everything but MAN if this isn’t the sweetest laptop to have ever hit the market, I don’t know what is. Notice I didn’t say best gaming laptop, but just laptop. This thing is the Holy Grail of laptops: light(ish), powerful, beautiful (both laptop and screen), and did I mention powerful?\n\nASUS really did an outstanding job here in upgrading the Zephyrus G16. Let me run through some of the highlights for me:\n\nScreen: The 2.5k OLED screen is absolutely gorgeous for both games and photo editing, not to mention just watching streaming services. The colors are bright, vibrant, and the blacks are oh so inky. I’ve watched a few of the more technical reviews of the G16 and it would seem that ASUS has done quite a feat of screen engineering to get an OLED screen to have such a high refresh rate with VRR. I don’t completely understand the technical aspects but I can see the results with absolutely butter-smooth graphics.\n\nTrackpad: You could play a game of baseball on a field the size of this trackpad! Not really, but it is absolutely huge and super silky to use. Quick, responsive, and precise. Also doesn’t look like a fingerprint crime scene after use. Easily the nicest trackpad I’ve had the pleasure to use.\n\nStyle: ASUS made some nice style and finish changes to the G16 that put it in the upper echelons of laptops. The solid aluminum chassis and the new hinge give the laptop a sharp, sophisticated, and sturdy design. I don’t particularly care about the lid light-up ‘slash’ but I think it looks sharp even turned off. While I appreciated the ‘lift’ effect of the previous Zephyrus, I did NOT like the blowing of the vents straight up the screen and into my face. When open this Zephyrus is a solidly rooted device that doesn’t budge when typing or gaming. It also looks good in business\/school situations where you don’t want garish LEDs and such flashing.\n\nPowerful: The Intel Core Ultra 9, 32GB of DDR5 RAM, and 16GB of VRAM on the 4090 just make this thing SLAY at pretty much anything you throw at it. I know that some reviewers were slamming ASUS for throwing in the 4090 when G16 can’t supply it enough power to really max it out, but what that overhead does give you for non-gaming needs can’t be over-stated. I’m not a computer hardware engineer but to me it does not feel like ASUS just threw that in here to boost the price, it feels like it’s there to provide the processing power to match not just some of the best gaming PCs but also the best productivity ones as well. I’ve attached some Cinemark 2024 scores to show how the G16 holds up.\n\nPower Brick: A lot of times the power brick for a laptop is a necessary evil and on some recent gaming laptops, they have been absolutely MASSIVE. I was pleasantly surprised when I pulled the 240w brick out and it was as small as some power bricks were YEARS ago. I have to think that ASUS is using some of the GaN architecture to reduce the size and heat produced by this thing. Some may also dislike the proprietary plug, but it is nice in that it is easily flippable like a USB-C plug but can actually handle the throughput, unlike the USB-C cables.\n\nSound: The Zephyrus G16 ROCKS! The six-speaker set up on this baby actually puts out not only LOUD but also GENUINELY GOOD sound. It can even kick some bass! Music, movies, and games all sound outstanding on the G16. Home theater quality, of course not, but I would not feel jilted at all curling up with this on the couch to watch the latest blockbuster movie. Also, while talking about sound, I would be remiss if I did not talk about the impact of the cooling system. While this thing can definitely ramp up the fan\/air noise when the CPU\/GPU are cranking, I was surprised at just how controlled and relatively ‘mellow’ that sound was.\n\nArmory Crate: Still my favorite ‘Command Center’ software of any gaming PC maker and the iteration here is top notch. Tons of information and controls at your fingertips.\n\nBattery Life: The 90 WH battery in this thing is very good and can keep you running for a while. I was unable to actually ‘stress test’ it because I was having some issues with booting up games and they were only opening up when on mains. Weird but I think it is a setting that I messed up, not ASUS.\n\nI have a few (remarkably very few) quibbles with the Zephyrus G16. Wish it had a bit more clearance underneath for air flow. Even though I haven’t had an issue yet, it kinda weirds me out having the bottom of the laptop so flush with the desk. Also, I don’t like that when I do try to power the laptop via high-powered USB-C, there is an annoying whine. I’m trying to track down the reason for that. It’s only an issue because I have an external battery specifically designed to power a beast like this when out and about and this will make using it a bit of a pain. But that’s really it. I have yet to run into a problem that wasn’t the software’s fault (looking at you Xbox GamePass Ultimate - which BTW you get three months of free with the laptop, but I have been unable to use it because it refuses to see me as logged in, not the fault of ASUS).\n\nFor me, until the ‘Fruit’ Company can make a MB Pro a viable gaming rig (they are at least trying now), This is the best laptop on the market today for anyone who has the money. It slays both as a gaming rig AND as a productivity machine, and is sharp looking while doing it.\n","rating value":3.56},{"name":"ryanmcv\n","description":"I've been looking forward to the new Zephyrus G16 since it was announced at CES earlier this year. At first glance, it appears to be the equivalent of a MacBook Pro in the form of a Windows laptop. I also own a 16\" MacBook Pro (M1 Pro model), so for the past week, I've been able to use them both side-by-side and see the good and bad of both machines. Bottom line: the Zephyrus G16 is a beautiful and powerful machine that will satisfy both creators and gamers, but it comes with some very notable tradeoffs including heat, fan noise, performance, and some areas of questionable build quality.\n\n=== DESIGN & BUILD QUALITY (4 Stars) ===\n- This G16 model is the \"Eclipse Gray\" color which I personally prefer over the other \"Platinum White\" color. The color is a bit darker than a Space Gray MacBook Pro. It does attract a few fingerprints, but they wipe away very easily.\n- Unlike every other ROG laptop I've used, this body of this new G16 is almost entirely aluminum, which gives it a very premium feeling. There is hardly any plastic to be found outside of the keyboard. Notably, the edge of the laptop near the trackpad is rounded, so there are no sharp edges that will cut into wrists while typing.\n- The laptop measures 13.9\" wide by 9.7\" deep, and just over a half inch thick. This model weighs about 4.3 pounds. If you've ever held or used a modern 16\" MacBook Pro, you will know what to expect -- the dimensions of the G16 are almost identical.\n- There are a decent number of ports available. On the left, there's the new \"ASUS Slim\" power port, an HDMI 2.1 port, a Thunderbolt 4 Type-C port, a USB-A 3.2 port, and 3.5mm jack. On the right, there's a full size UHS II SD card reader, another USB-A 3.2 port, and a USB-C 3.2 port. There is no Ethernet port on this laptop.\n- For its 2024 models, ASUS introduced its new, proprietary \"ASUS Slim\" power port. I like that the plug is reversible similar to USB-C, but I was hoping that ASUS would also be able to reduce the size of the actual power brick. Unfortunately, that isn't the case. The included 240W power brick is still pretty bulky, and you'll need to find room for it in your bag if you want to get the most power out of this laptop while traveling. You can also power and charge the laptop via USB-C, but the laptop can only draw up to 100W of power via USB-C, which will limit performance.\n- The new “Slash Lighting” array on the cover is neat, but I’m indifferent towards it. You can select tons of different flashing patterns, but when you’re using the laptop, you can’t actually see the lights. But if you’re a fan of minimalist decorative lighting, you’ll like the new Slash light.\n- There are a couple of things about the G16's build quality that concern me. First, the hinge of the display does not feel very tight. As such, the display is a bit wobbly when it is touched. If you pick up the laptop while it is open, there is a very good chance that the display will fall further backwards due to the looseness of the hinge. Secondly, there are significant \"creaking\" and \"popping\" noises that come from the machine's bottom cover whenever there is any amount of pressure applied to the bottom of the laptop.  In day-to-day use, the issue is most noticeable when using the laptop on my lap or picking it up to move it. The simple movements of my lap or changes in pressure to the bottom cover when moving the laptop are enough to cause very audible creaking\/popping\/flexing noises. I've tried tightening the screws on the bottom cover and I've made sure that the bottom cover is properly seated. But the noises persist, and it can definitely be annoying. I attempted to contact ASUS about these build quality issues before I posted this review, but I did not receive a response.\n\n=== DISPLAY, KEYBOARD, TRACKPAD, & AUDIO (5 Stars) ===\n- The star of this laptop is unquestionably the beautiful 16:10 2560x1600 OLED display. I thought the 16” MacBook Pro had reached the pinnacle of laptop displays, but I was wrong. The OLED panel in the G16 is a sight to behold with perfect black levels and rich, deep colors. Viewing angles are perfect from every direction. While only rated for 500 nits, the display gets eye-searingly bright. The 240Hz refresh rate and G-SYNC support mean that games look incredibly smooth with no tearing or choppiness. Creators and gamers alike will love this OLED panel, I’m sure.\n- The keyboard seems similar to past ROG Zephyrus laptops that I’ve used. Keys have 1.7mm of travel and the key caps are very large and nicely spaced. The keyboard is RGB-lit, though the entire keyboard can only display one color at a time (there are not multiple RGB zones to control).\n- The trackpad is among the best I’ve ever used on a Windows laptop. It is very large and made of smooth glass. It appears to be a 16:10 aspect ratio to match the laptop’s display. Gestures work perfectly. My only complaint is that the trackpad is not haptic like the one on a MacBook Pro. Rather, the G16 trackpad is a traditional “diving board” mechanism that is easily pressed at the bottom but can’t be pressed at the top. It would be nice if the entire surface was clickable like a MacBook.\n- Likewise, the speakers are probably the best I’ve used in any Windows laptop. They are just a small step below the quality of the 16” MacBook Pro speakers. Bass is rich and deep and there is practically no distortion at higher volumes.\n\n=== PERFORMANCE, COOLING, & UPGRADES (4 Stars) ===\n- The Intel Core Ultra 9 processor is powerful, but it’s a significant step down from the Core i9 processors offered in other ROG laptops. Intel’s Ultra processors are designed for thin and light laptops to minimize heat and maximize battery life. As such, there are some performance compromises. In TimeSpy, the highest CPU score I was able to achieve was 11,939, which is about 15% lower than a Core i9-13900H.\n- The following benchmarks were conducted with the “Turbo” setting selected in ASUS Armoury Crate: Time Spy benchmark: 16,424 (graphics score 17,874). The Last of Us Part1 (High preset, DLSS set to Quality): 70 fps average. God of War (Ultra preset; DLSS Quality): 87 fps average. Cyberpunk 2077 (Ray Tracing ultra, DLSS Quality & frame gen): 90 fps average. Dead Space (Ultra preset, DLSS Quality): 88 fps average. So yes, you run practically any game at high or ultra settings.\n- Compared to other laptops with the same specs, these benchmarks are a bit lower. This is mainly due to the lower-powered RTX 4090 in the G16, which can only draw a maximum of 115W. Other, thicker laptops with a 4080 or 4090 can draw more power and deliver better performance. I didn’t get a chance to test a 4080 model of the G16, but I have to imagine the performance difference between the 4080 and 4090 in these G16 models is minimal.\n- When under full load, this is probably the hottest laptop I’ve ever used. If you touch the bottom of the laptop or the area right above the keyboard while gaming, you might regret it. No joke: it’s like touching a hot stove top. I saw the CPU get as hot as 93 degrees Celsius, while the GPU seems to top out at a more reasonable 80 degrees. But the thin form factor and aluminum design of the G16 make for a VERY hot laptop.\n- Similarly, if you get annoyed by fan noise, this is NOT the laptop for you. The fans aren’t very noticeable when doing simple tasks such as web browsing or light photo editing. But once you set the laptop to “Turbo” mode and start gaming or doing more intense creative tasks, you’d better grab a pair of headphones: the fans get as loud as 49 to 50 dB, and the fan noise is relatively high-pitched. I am still playing around with the fan curves in the Armoury Crate “manual” mode to find a good balance of performance and fan noise.\n- Battery life is decent for such a thin and powerful machine, but it’s going to be LARGELY dependent on how you use this laptop. I was able to get about 6 hours of use with standard web browsing and day-to-day tasks (screen at half brightness). I decided to really test the battery’s limits by playing The Last of Us on Performance mode – and the battery was dead within 1 hour. So if you want to game while traveling, don’t forget the power adapter.\n- The included 2 TB SSD offers tons of space and is very fast, with read speeds upwards of 7,000 MB\/s and write speeds of 6,500 MB\/s. There is one extra M.2 slot if you want to add more storage.\n- 32GB of DDR5 RAM are soldered onto the board. As such, you can’t add or upgrade the RAM, so I’m glad ASUS decided to include 32GB rather than 16GB. The RAM clock speed is 7500 MHz.\n\n=== SOFTWARE AND OTHER THOUGHTS ===\n- There is a decent 1080p webcam (Windows Hello-capable) on the bezel above the screen. It’s not the best quality but gets the job done. This is a big improvement compared to the unreliable fingerprint readers in older ASUS models.\n- The included Wi-Fi card is capable of Wi-Fi 6E. I was hoping ASUS would include a Wi-Fi 7 card as that technology is is rolling out very rapidly.\n- The ASUS Armoury Crate and MyASUS apps are essential for tweaking the performance and cooling of this laptop and performing updates, but they just seem bloated and confusing, with basic options hidden behind layers of menus.\n\n=== OVERALL ===\nThe Zephyrus G16 aims to please both creators and gamers with its sleek design, stunning OLED display, and powerful performance. However, it also has some major drawbacks, such as excessive heat, loud fan noise, and lower performance compared to other laptops with similar specs. Additionally, some aspects of the build quality, such as excessive heat, loud fan noise, and lower performance compared to other laptops with similar specs. Additionally, some aspects of the build quality, such as the loose hinge and the creaky bottom cover, may annoy some users and detract from the premium feeling of the laptop. Overall, the Zephyrus G16 is a beautiful and capable machine, but it comes with some tradeoffs that may not be worth it for everyone.\n","rating value":4.023255814},{"name":"Leonardo\n","description":"This is an incredible machine and Asus has done an excellent job bringing this product to market. Initial impressions right after unboxing are that this will be a quality laptop, on par with MacBooks. The feel of the case, the responsiveness of the keys, and the sharpness of the display all satisfy the reason to buy this. However, it is the lasting effect that defines a product, and there are a few considerations to be made before pulling the trigger.\n\nBefore we jump into the hardware, let's talk about the laptop itself. It is incredible how slim it is and yet still be able to house such powerful hardware.  The design is essentially like a MacBook, and it's all aluminum chassis makes it super lightweight and rigid at the same time. There is no flex when typing nor will your arms get sore since the edges have been rounded off. Once again, the keys feel very responsive and bounces back with a lot of force. As far as I am concerned, this is the best laptop keyboard I have used. FN key choices are, well, not the best in my opinion. Why do we need a snipping key when there is already a windows default hotkey for it? At least you have four customizable buttons at the top so not a real big loss. I\/O ports are fantastic, they give you everything you need. I am tired of having only usb-c ports and carrying dongles everywhere. Another nice to have is you can still charge through the usb-c, just don't expect to have full charging as with the adapter. The screen gets extremely bright and is especially useful for editing photos. Speakers have full sound and can be fine tuned through the Dolby Atmos app. Overall, there is not really anything bad to say, it's a joy to use when either gaming or working.\n\nThat being said, the hardware seems to be a mismatch for this laptop. There are many complaints about fan noise and it holds true. Even on silent mode, the fan still kicks in a little. If you are bothered by fan noise in the slightest, this is not the laptop for you. The 4090, an incredible GPU, even after having it's voltage cut to fit this laptop it can still perform. The 185H processor, on paper looks like it can do it all. What is noticeable is this laptop will thermal throttle all the time. Any application that uses CPU and GPU together, you can basically say goodbye to your CPU. It seems all the power is given priority to the GPU and the CPU will dip below 40 watts. That being said, sometimes it feels as if the CPU just hasn't been configured correctly. I have tested trying to give the GPU little power and CPU more power, and yet it still drops below 40 watts when gaming. On the silent profile, it is wildly inconsistent where the speed will drop to 300 Mhz, making it impossible to game. Now that does not mean this laptop cannot game; it will still hand down beat the 4080 variant every time. But you may notice your frames dip every now and then because of the CPU. \n\nTo wrap this up, I have mixed feelings about the laptop. If bought specifically for gaming on the go, this is a disappointment when the 4080 variant is a much better value. However for specific use cases where the 4090 is utilized more effectively, it is very nicely packaged in a slim profile. You can argue that this is the best you can get for the form it's in, and the form is nearly flawless.\n","rating value":3.6909090909},{"name":"MohamedE\n","description":"I recently purchased the ASUS ROG Zephyrus G16 from Best Buy, and it has exceeded all my expectations. Here's a breakdown of my experience:\n\n**Performance:**  \nWith the Intel Core Ultra 9 and NVIDIA GeForce RTX 4090, this laptop is an absolute powerhouse. Whether I'm gaming, streaming, or working on resource-intensive tasks, it handles everything with ease. The 32GB LPDDR5X RAM ensures smooth multitasking, and the 2TB SSD provides ample storage space for all my games and files.\n\n**Display:**  \nThe 16\" OLED display is simply stunning. The 240Hz refresh rate is perfect for fast-paced gaming, delivering buttery-smooth visuals. The colors are vibrant, and the contrast is deep, making both gaming and media consumption incredibly immersive. The Eclipse Gray finish adds a sleek, premium touch to the overall design.\n\n**Build Quality:**  \nThe build quality is top-notch. The laptop feels solid and well-constructed. It's also surprisingly lightweight and portable for a gaming laptop with such powerful specs. The keyboard is comfortable to type on, and the RGB lighting adds a cool aesthetic without being too flashy.\n\n**Thermals and Battery Life:**  \nThe cooling system is effective, keeping the laptop cool even during extended gaming sessions. Battery life is decent for a gaming laptop, though it's best enjoyed when plugged in to fully utilize its capabilities.\n\n**Overall:**  \nIf you're looking for a high-performance gaming laptop with a stunning display and excellent build quality, the ASUS ROG Zephyrus G16 is an excellent choice. It’s pricey, but considering the specs and performance, it's well worth the investment for serious gamers and power users.\n","rating value":5.0},{"name":"Chuck\n","description":"I bought an Asus gaming laptop years ago and absolutely loved it, so I was excited to test this one. The first thing that stands out about this laptop is how thin and light it is; it doesn’t even look like a gaming machine.  The aluminum frame gives the unit a solid, premium feel, but I believe the aluminum is primarily for heat dissipation (more on that later).  For its size, the laptop has an adequate number of ports; 2 USB-C, 2 USB-A and HDMI, as well a headphone jack and SD slot.  That number of ports in a laptop this size is very nice.  The power adapter uses a rectangular connector which is a bit odd, but to be honest it might have been required because of how thin the machine is.  Upon startup, it is apparent that the OLED display is one of the main selling points; it’s bright, crisp… basically gorgeous.  The speakers are mounted on either side of the keyboard and do a good job of immersing you in the sounds of a game, although I’m sure most people will play with a headset.  The touchpad is sandwiched between the bottom of the keyboard and the very edge of the frame.  The keyboard itself is quite nice; the keys are very responsive and feel great, however, I have large hands, and although I don’t feel like my hands are cramped when using the keyboard, for some reason I find myself dragging a thumb across the touchpad quite often.  The keyboard lighting can be controlled via the Armoury Crate app, but I usually just set this and forget it.  Overall, the physical appearance and build of the laptop are impressive, especially when you realize what Asus has packed into the unit.\n\nRegarding actual game play on this laptop, I was really interested in seeing how long the battery lasted, and as I thought, even with moderately ‘excessive’ in-game graphics settings, the battery lasted around 1-1.5 hours, so prepare to have it plugged in and on a surface that will allow maximum heat dissipation, especially for longer gaming sessions, because it does get hot.  The fans are noticeable while working to keep everything as cool as possible, especially under heavy load, but they’re not annoying, at least in my opinion.  The unit has easily handled the games I regularly play, maintaining 70-100+ fps even on an external 4k display.  However, you are not going to be placing this machine on your lap, or any other surface that doesn’t allow complete unobstructed airflow to the bottom intake vents.  I used a tiltable wire mesh stand to elevate the laptop and I was still watching the CPU temp spike (2-3 secs) to 93-94 Celsius when playing certain games.  The GPU temps stayed well under that, hovering around 60-70 Celsius under load, but the CPU temps do seem to cause some throttling at times.  The case also becomes quite hot on the bottom and above the keyboard… I’m not sure I’d label it as ‘blistering’, but you’re going to feel it.  I also noticed that when the lid is open, the display obstructs the exhaust ports.  It doesn’t completely cover them, but the farther the lid is opened, the more it obstructs.  I contacted Asus and received the following: “When the lid is in the open position it doesn’t obstruct the airflow of the exhaust on the rear. There's also ventilation on the bottom of the rear to support the rear exhaust. You can use the built-in application to measure the temperatures of the notebook. 120 Fahrenheit (48.8889 Celsius) is great when under load anything more than 212 Fahrenheit you may want to allow the system to cool down.”  I reached out to Asus again to see if they were referring to the GPU or CPU temps, but as of yet, I haven’t heard back from them… I assume they are referring to GPU temps, which is not what I was concerned about.  Maybe the obstruction isn’t considered a problem, but I’ve watched the CPU temp climb 1-2 Celsius (using the Armoury Crate app) by moving the lid from about 30 degrees to fully opened.  \n\nOverall, I do believe this laptop is a solid gaming machine, although I’m concerned about the heat and its long term effects on the components over time.  The cost is high, but it’s comparable to other brands with similar specs.  This laptop is very light and compact, and the display is absolutely incredible, making it perfect for someone on-the-go.  So if you’re in the market for a high-end ultra-portable gaming laptop, this machine might be a good fit for you… just know that it’s going to run hotter than what you’re used to (at least that was my experience).\n","rating value":3.5777777778},{"name":"PeterV\n","description":"This is one of the best laptops I have ever owned. I could really just compare it to a MacBook. RTX 4090 is a bit underpowered with 125 W TGP but I did a Vbios swap and managed to tweak it so that it can use up to 175 W. I only use up to 150 though to make sure it doesn’t burn down. Literally the only downside compared to MacBook is the battery life. With my best optimization settings, I can increase its battery life to about 8 to 9 hours but without it, it can only last about 5 to 6 hours. It does charge relatively fast so I can work around this. The design is also superb. The keyboard is amazing to type on the 240 Hz OLED screen looks absolutely stunning. The Zephyrus G16 is an extremely high-quality device. The price was OK with $600 off. Otherwise I would’ve bought the 4080 edition.\n","rating value":4.2},{"name":"Christian\n","description":"*Display*\n\n 10\/10\n\nOled and 240 HZ with G-sync and for those who don’t know what g-sync does, it makes games the run at lower FPS feel smooth. As for OLED, you must experience this yourself, it’s the most beautiful screen you will come across with vibrant colors and pure blacks while being super responsive.\n\n*Speakers*\n\n10\/10\n\nSo this is the best speakers on a windows laptop I have ever heard, you will not be disappointed with the crisp sound paired with the Dolby atmos license(sold on Microsoft store). It makes you feel like there are others legit speakers to your right and left. Only downside I have for this is that I had to return my first order because the left speaker started popping. I do think this was a coincidence and I was unlucky.\n\n*Build quality*\n\n7\/10\n\nSo it’s feels great to use and is very light, most people will be satisfied with it. The screen does wobble too much for me. You can test this  by just pushing the display back a little bit. I want to note that I don’t notice it during gaming. Also putting some pressure on certain parts of the keyboard resulted in a disappointing creaking noise from the chassis.\n\n*Performance*\n\n8\/10\n\nTo keep it honest, you’re not getting the best performance for gaming that you could get out of this 4090 laptop. This is more of a hybrid. You can game at maxed out settings if you want however, you will be somewhere around 30-40 fps behind a full powered 4090 laptop gpu. This laptop maxes out at 125w vs the standard of around 175w+ on other laptops. When you are unplugged this has a great Intel chip that allows you to get roughly 6-10 hours of battery life which I see as really cool. I do want to note though, this laptop feels sluggish while running on eco mode. Definitely nowhere near as fast as I would like it to feel while on battery. I’m talking specifically while web browsing and doing non-gaming related tasks while on battery such as movies, navigation of windows ect.\n\n*summary*\n\nI would buy this again, what makes this really awesome for me is that it is light and packs a lot of power in such a slim form factor. This isn’t the best gaming performance you can get but it’s more than good enough to run at max settings. If you are on the fence with this one, I would try it out.\n","rating value":4.1578947368},{"name":"MarkusKong\n","description":"TL;DR\nThe ASUS - ROG Zephyrus G16 (2024) is a high-end\/high-quality gaming and multimedia laptop with an extremely beautiful OLED display while boasting some amazing speakers. If you are in the market for an upgrade or simply looking to purchase a new gaming\/content creating powerhouse laptop that is also compact and premium; the ASUS - ROG Zephyrus G16 (2024) will fit most if not all of your wants and needs.\n\n–\n\nI have to first talk about the build quality of the ASUS - ROG Zephyrus G16 (2024) which is a thing of beauty. The laptop is very minimalistic and compact (besides the slash lighting on the lid which can be programmed or completely turned off). Now when I say compact, I mean this only weighs 4.3lbs and is 1.7cm thick! The feel and look of the ASUS - ROG Zephyrus G16 (2024) is nothing short of “premium”. It features a beautiful aluminum case body that personally really reminds me of an Apple MacBook Pro with its rounded edges. Now don’t let the looks fool you folks, don’t blink… This compact yet powerful laptop contains an Intel Core Ultra 9 185H processor, Nvidia RTX 4090, 32GB LPDDR5X RAM, 2TB SSD and of course a stunning 16” OLED 240Hz ROG Nebula HDR Display that is NVIDIA G-SYNC ready!\n–\nNow when it comes down to performance, one thing to keep in mind is that the ASUS - ROG Zephyrus G16 (2024) is made to do it all. So what does that mean? It means that it’s not necessarily a full fledged gaming rig. You can already tell based on what I mentioned above about how compact and elegant it looks; it's designed to be more than just a gaming laptop. It’s an on the go minimalistic yet premium and lightweight laptop that can be utilized for professional purposes (like work), content creation as well as gaming. While the gaming performance isn’t blowing everything out of the water, it’s definitely not by any means a last contender. I had the luxury of testing several games such as CS2, Helldivers 2, Shadow of the Tomb Raider, Far Cry 6, Red Dead Redemption 2 and many others. Most games held over 60fps gaming in QHD+. Long story short in terms of gaming performance, I was able to throw everything at it and thoroughly enjoyed the gaming experience. I also ran some benchmarks and again not mind blowing but also not by any means mediocre. With everything said, please keep in mind that the reason behind why this beauty isn’t outperforming everything is because although the internals are “top of the line”, it has to take a hit somewhere and that somewhere could be things like component power output and airflow due to everything being contained in a thinner chassis. So basically what I am trying to say is a 4090 in the ASUS - ROG Zephyrus G16 (2024) isn’t necessarily the same 4090 in a desktop. Now you are probably wondering how the temps are. Thanks to the Vapor Chamber the CPU temps are around mid 80s while the GPU temps are around mid to high 70s (this is while gaming on Performance Mode via ASUS Armoury Crate). Keep in mind you can bump up the performance slightly by changing to Turbo Mode but fans will definitely kick up as temps will rise and don’t forget about fan noise as well. Personally I felt it most comfortable to leave it on Performance Mode. One thing I can recommend (in any case scenario where you are using a laptop for gaming) is trying to elevate\/raise the laptop as this will help the fans dissipate the heat which in turn can help with performance (avoiding any possibility of thermal throttling).\n–\n\nOverall, the ASUS - ROG Zephyrus G16 (2024) is definitely an excellent choice for anyone looking to splurge a bit in a compact yet absolutely stunning laptop. The fact that this thing of beauty can pack all it has in such a light and thin aluminum chassis is outstanding (not to mention the astonishing 16” OLED 240Hz ROG Nebula HDR Display). If you are someone that uses a laptop for work, content creation and gaming; the ASUS - ROG Zephyrus G16 (2024) fits the bill.\n","rating value":3.2857142857},{"name":"Michael\n","description":"I wanted a computer with the display and sound of a MacBook and power similar to that of my PC workstation for under $3,000. This is exactly what I was looking for. I got it for $500 off and I couldn’t be happier.\n\nThe Display - Fantastic. Resolution is great - I don’t think I would notice if it were any higher. HDR content looks amazing. On par with Mac.\n\nSpeakers - Really great. The best I’ve heard on a windows laptop by far. Not quite as good as MacBook but still great.\n\nBlender and Render - I got the 4090 version which was on sale for the price of the 4080. Going into it I knew the GPU is under powered in order to be delivered in this price range at this form factor. I have a workstation with a 4070 ti which is a little faster than a normal-powered laptop 4080 according to blender benchmark. I was hoping for that same speed from this since it’s a little underpowered. It ended up being even with my 4070 ti which I’m really happy about. You can put more power into the GPU using G-Helper but since I’m letting this render for extended amounts of time that little bit of speed is not worth the overload for me.\n\nAll in all - This laptop is great and I would definitely recommend. Would I pay full price for the 4090 version? I’m not sure. I may opt for the 4080 at that price point. \n\nGHelper note\nI do recommend using G-Helper instead of armorycrate but I suggest familiarizing yourself with the settings in armorycrate first as I overlooked a few things like color profiles and whatnot in G-Helper due to the condensed interface. \nG-Helper is really nice for dialing in and switching quickly between different profiles. I set up one to keep the temps down to a spot I was comfortable leaving it rendering overnight at the cost of fan noise and a little cpu power - One for normal video editing or animation work - One to keep it really silent when I’m working in a quiet environment. These were similar to the defaults but G-Helper made them really simple to dial in and toggle between. Plus the FN lock is a huge plus.\n","rating value":3.7142857143},{"name":"fieldsfury\n","description":"Bought this for both gaming, work, and business. I needed a slim laptop that could do everything I wanted to do. The all metal design and build quality are great. The 4090 graphics card is amazing, although not fully powered like other laptops, but regardless powerful enough to play games as you see fit. The only negative I have is when playing games or performing other high demanding tasks, the laptop does get scorching hot on the bottom rear and above the keyboard in the center. If playing games, this must be on a table or laptop cooling pad or ensure you have enough ventilation to allow the laptop's fans to do their job. The other thing that is great is the battery life if using the internal graphics. Once you switch over to the dedicated graphics (4090) the battery is like every other Windows PC. Upgrade the NVME SSD as well. I installed 1 4TB in the other available SSD slot. Loving the laptop!\n","rating value":4.6666666667},{"name":"PawelD\n","description":"The **Asus Zephyrus G16** is a true masterpiece, impressing with both its aesthetics and performance. Its minimalist and sleek design strikes a perfect balance between professional elegance and subtle gaming accents. The slim chassis and modern finish make it stand out, whether you're using it in a work environment or for gaming sessions.\n\nIn terms of graphics performance, the Zephyrus G16 is top-tier. Equipped with an NVIDIA RTX series graphics card, it delivers smooth gameplay and stunning detail, satisfying even the most demanding gamers and creators. Whether you're rendering graphics, editing videos, or playing at high settings, it handles everything effortlessly. The QHD display with a high refresh rate ensures incredible visual quality, deep colors, and sharpness, enhancing the overall experience.\n\nIts processing power is another standout feature. With a 13th Gen Intel Core processor and plenty of RAM, the laptop handles even the most demanding tasks, from advanced multitasking to resource-heavy applications. This makes the **Asus Zephyrus G16** the perfect choice for those who want both top-tier performance and stunning aesthetics in one device.\n","rating value":5.0},{"name":"CalvinJ\n","description":"This is a Great Laptop so great I wished for another one for Christmas for myself my son says the speed is awesome and the FPS and ping is top of the chart, whatever that means but he has not complained. this Gaming laptop is well constructed for both school and play. I recommend this on for sure. oh yeah the price is RIGHT!!\n","rating value":3.6666666667},{"name":"TJB426\n","description":"A well built, compact, relatively lightweight laptop with a beautiful 16 inch OLED display, backlit keyboard, huge trackpad, and more.\n\nMy first impression after unboxing it was 'how did they make it that compact for what is in this?!?' This thing was built to tackle anything with 32GB Ram, GeForce RTX 4090, Intel Core Ultra 9, and 2TB SS Drive. It's almost overkill for multitask, media editing, and gaming. But that is exactly what you are probably looking for!\n\nOLED display brings beautiful colors and contrasts to allow your self to be fully emersed in your game or creative content. Coupled with brilliant audio through multiple speakers.\n\nI'm not typically a trackpad user if I don't need to be, but I have to say that the size, responsiveness, and smooth surface is worth some spot light. This is definitely my favorite design and feel of any track pad I've used. \n\nDespite being concerned that with the vents being on the bottom of the laptop and not having much space between the base and the table, the laptop stays at a good temperature. The ASUS Armoury Crate allows you to monitor and adjust various settings for performance and even lighting. The ASUS ROG Zephyrus G16 (2024) features a unique lighting slash on the lid that is customizable along with the backlit keyboard.\n\nOverall this thing is a beast of a laptop, ready to tackle just about anything.\n","rating value":3.6666666667},{"name":"TechGuy\n","description":"When the new G14 and G16 models were announced with high refresh rate OLED screens, with Gsync included I was super excited, especially when it became apparent how thin these were going to be, as portability is huge for me. How ever when this arrived I was a little disappointed. The fans ran constantly even when I was barely doing anything. I may have just had a bum model idk, but it made it nearly unusable. Also the black RGB keyboard did not look nearly as nice as the white variants for some reason, I could never find the right color to compliment the looks of the laptop for some reason. Also I was impressed with how thin it was, but for some reason this new 16” form factor seems to be such a larger footprint than the old 15” form factor. I am sure it would be great for a desktop replacement, but I already also have a desktop, and this just felt almost too big to use on my lap when I am away from my desk. I actually ended up taking this back and going with the new 2024 G14 Zephyrus instead in white, as it felt so much more portable, the white aesthetics are stunning, and I am guessing due to the Ryzen processor it typically runs much quieter during normal tasks like web browsing etc.\n","rating value":3.5714285714},{"name":"aaaaaack17\n","description":"Man this laptop is a BEAST! To give context, i am a senior in college majoring in graphic design. I do alot of my work with things like Figma, Photoshop, Illustrator and After Effects. I am also a big gamer and basically getting all around performance was the main reason i wanted this laptop. The laptop surpassed all my expectations, it runs games really smoothly and the Amoled screen is gorgeous (i havent had any issues with the screen even though i know some people have). Its such a lightweight laptop and its honestly insane how far gaming laptops have come because this literally looks and feels like a typical laptop that wouldnt be meant for games. I got the 4090 version of this laptop so it lasts me a long time and can continue to be fast when i start working and for leisure activites and let me tell you it does not dissapoint. Although, i will admit when i first got it i was kind of dissapointed with FPS and temps but uninstalling armoury crate and installing g helper fixed this issue. Overall if your a student or someone who works and plays a decent chunk of games and loves portability in a light package this is definitely the laptop for you. Ive had it for around a week now and i seriously couldnt be happier. OH! I also forgot to mention, the battery life is pretty decent, i had class all day and was able to get around 6-7 hours of use which is insane for an intel machine.\n","rating value":3.4615384615},{"name":"JesusP\n","description":"The ASUS - ROG Zephyrus G16 (2024) is nothing short of a marvel in the realm of gaming laptops, setting a new benchmark for what I consider an exceptional gaming experience. At the heart of this powerhouse is the formidable NVIDIA GeForce RTX 4090 GPU, delivering unparalleled graphics performance that elevates gaming to cinematic heights. This GPU, known for its efficiency and raw power, ensures that even the most graphically demanding games run flawlessly, with rich details and smooth frame rates.\n\nWhat truly astounds me is how this laptop serves as a perfect desktop replacement without compromising on mobility. Its lightweight design is a testament to ASUS's engineering prowess, making it an ideal companion for my travels. The ability to carry such immense power effortlessly enhances not just gaming sessions but also productivity on the go.\n\nInitially, I encountered some hurdles with software configuration and connectivity. However, a fresh reset of Windows resolved these issues, leading to a seamless and smooth computing experience thereafter. This hiccup was minor in the grand scheme and did not detract from the laptop's overall stellar performance.\n\nThe Zephyrus G16 stands out for its acoustics as well. Whether in silent mode for everyday tasks or performance mode for gaming, the laptop remains remarkably quiet. This is a significant achievement, considering the power it packs. It ensures an immersive experience without the distraction of noisy fans.\n\nIn summary, the ASUS - ROG Zephyrus G16 (2024) fulfills every criterion I had for a top-tier gaming laptop. Its exceptional performance, combined with portability, cutting-edge graphics, and quiet operation, make it a comprehensive package. For anyone in search of a gaming laptop that can double as a mobile workstation, look no further. The G16 is a testament to ASUS's commitment to pushing the boundaries of what gaming laptops can achieve.\n","rating value":3.6666666667},{"name":"emiilio\n","description":"Performance:\nThe fan was surprisingly quiet, and the speakers really impressed me with their clarity, great mids, and bass, rivaling MacBook Pro 16, sometimes even surpassing it. The Core Ultra chip didn't quite deliver the power I expected, especially for gaming, leaving me wanting more in terms of performance during intense gameplay sessions or when tackling demanding tasks like coding, web design, or running simple machine-learning tasks.\n\nGeneral web browsing performance was smooth when plugged in, but I noticed occasional stuttering and overall sluggishness when running on battery saver mode. This detracted from my overall user experience and highlighted the need for optimization in power management settings.\n\nGaming and Battery Life:\nGaming performance was so-so, with the GPU and CPU delivering decent but not outstanding results. While the laptop managed to handle most games, it struggled with more demanding titles, leading to occasional frame drops and lag. You're looking at roughly equivalent performance to a higher wattage (150w) 4080 laptop. Additionally, battery life lasted around 5 1\/2 hours with battery saver on and light use without tinkering with TDP settings, which was okay for casual browsing and productivity tasks but fell short of providing all-day usage without the need for a recharge.\n\nPlugged-In vs. Battery:\nWhen plugged in, the laptop performed wonderfully, with a beautiful display and delivering solid performance without any noticeable slowdowns or compromises. But, swap to battery power had me managing expectations for both performance and battery life, since the system scaled back to conserve energy. Unplugging led to performance reductions and shorter battery life beyond what I would've expected with a generation leap, even on battery saver. I'll also point out that it seems like ASUS is finally allowing passthrough charging with the USB C ports so thank you for that!!\n\nUser Experience Examples:\nExample 1 - When I leave my laptop idle for extended periods, I just want instant responsiveness with minimal battery drain, much like my MacBook (you can leave those unplugged for a week and jump right back in). I to resume work without any delays or interruptions. But every time I left this sleeping for more than an hour or two, I had to wait 10-15 seconds before I could log in because the laptop was placed into hibernate automatically. And if I disable that feature, then Modern Standby would eat up 2-3% of the battery every hour.\n\nExample 2 - When I'm out and about. I don't want to worry about battery life or making constant adjustments to optimize performance. These challenges aren't ASUS' fault (they're using the best available off-the-shelf parts), but even the best parts available now lead to an experience that gets me worried about leaving my charger behind and highlight areas for improvement in future iterations.\n\nComparison and Future Prospects:\nCompared to other options, this laptop falls short in some areas, such as the maximum RAM limit and overall performance on battery. Looking ahead, I'm excited for future iterations and how they could shine with improvements like a next-gen Core Ultra chip.\n\nIf you need gaming on the go with thin-and-light being a must, want a beautiful screen+great speakers, there is nothing better available today. This is the best option bar none. \n\nBut since ASUS is marketing this as part-creator device, this is not the best laptop for that use case, even compared to some other Windows laptops, and definitely not compared to Macs.\n\nOverall, temper those expectations a bit and you'll probably love what ASUS have managed to achieve in this year's Zephyrus G16.\n","rating value":4.2},{"name":"nautec\n","description":"The Asus ROG Zephyrus G16 gaming laptop is the absolute definition of luxury computing.  For a laptop of this size with an amazing clear OLED screen with an Intel Core Ultra 9 processor, 32 gigs of RAM and crazy NVIDIA 4090 GeForce RTX video card, it is super thin and quiet.  Most computers with this configuration would be thick and loud because of all the cooling necessary to prevent you from cooking your dinner on it.  The metal body of the laptop just feels solid and sturdy but the intelligent fan system that ASUS puts on this thing just whispers during heavy gaming sessions.     This laptop also includes an IR camera that allows you to use Windows Hello’s facial recognition system.  This is super handy to help with Password Managers.  Surprisingly, the top facing speakers provide great sound.  The great speakers come at the sacrifice of a Number pad on the keyboard.  So, if you absolutely need to have the right hand numpad to do work, then you would need to buy an external numpad.  Another annoying part of this laptop is the power plug.  It is a proprietary square plug and sticks out perpendicular to the laptop.  This might be a problem because if you use this laptop at the edge of a table, a lot of downward stress is placed on the plug.  However, given those two annoyances, this is a masterclass of what a powerful gaming laptop that has luxury feel and is razor thin without sacrificing thermal properties.  You can tell that this laptop is going to be used for many years to come and if you are a gamer that values portability, this is definitely a laptop you should look at.\n","rating value":4.0},{"name":"GilbertA\n","description":"After trying multiple laptops I finally found the one that fits my needs. This laptop has a great oled display and does fairly decent on games, I’m able to run 70-90 fps on call of duty black ops 6 on max settings, not the best but you can’t beat the stunning graphics. Only reason I give this laptop 4 stars is because how extremely hot this thing gets while running graphic intensive games I cannot even have it on my lap without burning me. But if you are in the market for a laptop for multi use without the gamer look then this is the one for you !\n","rating value":3.2857142857},{"name":"AdamB\n","description":"A slim, light mobile powerhouse that is aesthetically pleasing with a few (minor) tradeoffs.  Those tradeoffs are that it isn't the most powerful 4090 implementation but when you look at the dimensions of this laptop, that should surprise no one.  The fact that it's as good as it is, that's a minor miracle.  Upsides: OLED display, speakers, weight, ports, performance.  Downsides: soldered RAM, not as high powered to the GPU as others, gets hot to the touch where the GPU is while under load, white option is more expensive.  This laptop, when on sale, represents a good value for the components inside, wish there was a 64GB version, wish there was a Ryzen 9 with the 4080 and 4090 models (I think there will be soon)!\n","rating value":4.0},{"name":"ZephyrusReviewer\n","description":"The G16 is a beast in disguise. Sleek, understated, and portable for a gaming laptop, it doesn’t scream \"gamer,\" but under the hood, it delivers some of the most uncompromising performance on the market. The OLED display is a stunner—deep blacks, vibrant colors, and the 240Hz refresh rate make games look buttery smooth and alive. It’s hard to go back to anything less once you’ve experienced it. Whether you’re gaming, editing, or just soaking in media, this screen feels like an overachiever.\n\nPerformance-wise, the RTX 4090 paired with the Intel Ultra 9 eats through anything you throw at it—no hiccups, no sweat. It’s not just raw power; the cooling system is impressively quiet for the hardware it’s taming. Yes, it gets warm (it’s a 4090, after all), but it doesn’t roast your hands or throttle like some laptops in its class. The 32GB LPDDR5X RAM and 2TB SSD are luxury-level specs that future-proof this machine for years, no question about it.\n\nBattery life? Not bad for the hardware, but don’t expect miracles—especially with an OLED and this kind of power draw. You’ll get a few hours out of it for light work, but gaming or heavy tasks will have you tethered to the charger. Speaking of power, the fast charging is solid, which makes quick juice-ups easy.\n\nBuild quality is solid, though the chassis feels slightly more practical than premium. The Eclipse Gray finish hides fingerprints well, but it doesn’t feel particularly “special.” The keyboard and trackpad are excellent—good key travel, solid layout, and a trackpad that doesn’t feel like an afterthought. Ports are abundant and well-placed, covering almost all bases without forcing you into dongle hell.\n\nThe downsides? The price is eye-watering, but that’s expected for this kind of hardware. Also, while portable for its power, it’s still a 16-inch gaming laptop, so don’t expect ultraportable vibes. The software suite—Armory Crate—feels a bit bloated but does its job.\n","rating value":3.8571428571},{"name":"Naponic\n","description":"From a creators perspective,  3d and video work was smooth and fantastic,... when plugged in, the fans do spin up and become audible when exporting video or when manipulating 3d objects in real time in Blender and ESPECIALLY when rendering a quick animation (or the occasional gaming), but was not as loud as the the 4070 or the 4080 model.\n\nBut when on the go, doing the same workloads I could get ~2 hours max before the gpu is disabled by the system, then the igpu  as the downclocked cpu  is not up to the task as well when under battery. Heavy workloads start to get choppy and unreliable especially in 3d applications like Blender, and when editing 2k footage. \n\nThe laptop got audible on the train and warm to my lap when exporting or working on 3d applications but was able to get 1.5 hours of work in before the battery hit the 25% mark from a 100% charge. \n\nIn conclusion, I would recommend this laptop for SHORT mobile workloads (1-2 hours tops), and its power, weight and size are its highest positives. As a desktop replacement, when plugged in and attached to an monitor, its a beast for its size, but it does get audible and  the heat I felt above the keyboard, it made me worry about damage to the fantastic oled screen when running in turbo mode WHILE the screen is closed. WOuld only recommend as desktop replacement, for medium workloads.\n","rating value":4.4285714286},{"name":"Zede\n","description":"Remarkable computer with an incredible screen. Audio puts the sound system on the Blade 18 to shame with better mids and much better lows. Could the processor be better? Sure but with Asus pursuing a thinner profile it makes sense. Fans do run louder but honestly not much louder than any other gaming laptop of this size. Overall expensive but you are paying for the form factor and that screen. Great step forward Asus.\n\nNovabench on Performance profile:\nSSD Write\nSequential - 4726 MB\/s\nRandom - 185 MB\/s\n\nSSD Read\nSequential - 6414 MB\/s\nRandom - 72 MB\/s\n\nRam Transfer\nPeak speed - 14420 MB\/s\nRam Access\nLatency - 98 ns\n","rating value":3.8571428571},{"name":"Flx911\n","description":"My 2 star review is solely based on value. Please be aware you are purchasing an underpowered 4090. If you purchase another laptop with a 175 top 4080 it will out perform this laptop in all games at max settings. Most full powered 4070's will come close to matching this under powered machine. So if you are on the OLED train, spend $300 more and get a Blade 16 4080 (nicer build, better CPU also thin) or save $300 and get a Blade 16 4070.  Me I returned this and picked up the Asus ROG Scar mini led 18. I did not care about thin and light. I think the 1100 nits mini led is more vibrant and eye catching. If you want something smaller the Scar is available in 16\". I just can't think of a good enough reason to over pay for a unit that doesn't  preform. However, if maybe you are looking for a laptop for media, and don't care too much about gaming then maybe you would want the G16??? At that point I would recommend the 4070. At least you are getting close to full power\n","rating value":4.2},{"name":"rayjj\n","description":"Nice solid laptop.  Haven't gamed a ton yet with it, but been pretty solid overall.  Definitely runs a bit hot when gaming or video editing.  Do yourself a favor and toss Armory Crate and replace wjth GHelper.  AC such a resource hog.  Lost a start just because of the price.  Went with this model to try and prolong the life and have this for many years,\n","rating value":4.0},{"name":"JordanP\n","description":"Runs intense games without any issues. I did uninstall armour crate in favor of a different program available through a Reddit search.\n","rating value":5.0},{"name":"Nicolas\n","description":"It’s truly remarkable that this laptop is the size it is for the amount of power it contains. Yes it does get hot above the keyboard but you aren’t touching that area. And yes the fans can get loud if you go into turbo mode. Besides that they are normal sounding fans. Not overly annoying. The screen and speakers are phenomenal. Battery life is good in silent mode. Standardly bad on high graphics games when trying to game without it plugged. About a hour to a hour and a half. \n\nCouldn’t be happier that I got this for less than 2900$ with open box. Said on the box it was due to residue which I could only even find on the track pad and was able to clean it with a screen cleaner. Now if I didn’t get this open box and paid full price at 3300$ I would be more hesistant to give it 5 stars due to value ratio of the 4080 model having 1tb less ssd and being 700$ cheaper.\n","rating value":3.4615384615},{"name":"Grayson\n","description":"I'm a full time photographer and videographer along with a heavy gamer. I needed a laptop for on the go editing and gaming and this laptop meets all my needs while being slimmer than my Macbook Pro! I'm able to run multiple Adobe programs with ease along with playing demanding games like COD and Halo. Only thing I didn't like about it was the Armoury Crate due to how hot it ran. I swapped out for Ghelper and it runs cool except for when I'm playing games or exporting large video projects. A+!\n","rating value":5.0},{"name":"BobP\n","description":"I liked the laptop, and the design, except the lid was too flimsy and I hated the slash.  The one I received had a slit bend in the lid and would not lay completely flat.  I returned it for the new Blade 16 OLED 4080.  A couple hundred more but the blade build quality is better and stiffer.  The blade 4080 performs much better than this 4090 with full 175w capabilities and the same battery life.  The G16 4090 was hitting around 17900 in timespy, and the blade 16 4080 cranks out consistent 19000-19300 runs. The blade is heavier but that’s fine.\n\nThe G16 speakers are incredible,  slightly better than the blade 16 OLED speakers.\n","rating value":4.2},{"name":"FartReviewer\n","description":"I've always been preaching to my family, who scoff at the ridiculously thick and heavy laptops I've lugged around in the past, that as soon as they make a macbook that can game, I'll be on it.  Well, they made one, and I bought it, and I'm sending it back to the lab it prematurely escaped from.  \n\nNow I will fully admit that this laptop is objectively the cats pajamas of thin and lights.  If thin and (somewhat) light is what you need, and no amount of v-ram is ever enough, then I couldn't be more excited to show this to you.  I believe, wholeheartedly, that this laptop is suitable for no one else.  I love refined things, thin things, trimmed fat and unwasted space.  I like minimalist designs and cold, hard alumininum.  I love oleds.  This ain't it.  \n\nNow, I could rant about how the Core Ultra's optimizations are subpar, or that the underpowered 4090 (which is 125W, nerds) underperforms (to the shock of no one).  And it does.  Or I could go in on the relatively creaky chasis.  I would prefer to keep it short with these topics. \n\n The 4090 is marginally better (20-25%) than a 4070 with 100+W.  This is sad.  I didn't even consider this when i was looking at the charts as i was so focused on seeing bigger numbers and 4090 has the biggest number when all things are equal.  This was meant to replace my g18 with a 175w 4080 because it's nearly 7 pounds not including the charger.  It puts out roughly 85% of the framerates of a 4080 (1600p and UWQHD).  My g18 was $2100 on sale.  This is sad.\n\nThe core ultra is inconsistent and the chassis creaks.  \n\nMore importantly than all of these very overlookable things, is the use case this presents for someone.  Now admittedly, the processor is about 1.5x-2x as efficient up until around 50w where it takes a sharp nosedive.  So if you really want to spend 4 hours and not 2.5hrs at the coffee shop, with no charger, at a min\/maxed wattage, then more power to you.  Or you really need to get through 3 movies back to back on low brightness and your charger vanishes, this HAS got your back.  However, aside from the incremental improvement in battery life these new ultras present, there's not much to them, especially when compared to other much more powerful processors.  They underperform compared to last gen's H tier chips just as much as they beat them out in battery life.  \n\nSo it's not a dedicated editing laptop.  If I wanted that, I'd get a much more powerful notebook with a core i9 flagship chip, or a mac with a much more efficient and furnished architecture.  It's not an even remotely cost effective desktop replacement, so main gaming rig is off the table for me as i like high resolutions with high framerates. \n\nThe gpu is riding a full premium price tag at a reduced performance.  This already irks me but doesn't warrant a single star being taken off.  I knew what i was getting myself into.  What's the deal? Heat.  This thing gets so hot that jeans cannot protect the leg during full power sessions.  No matter, i'll put it on a surface.  Now we have problem 2 with the heat.  The exhaust vents are a fractions of the size of any other gaming laptop I've ever seen.  The intake fans are too thin, and therefore without a laptop pad to assist, the cpu soars to the 95-100 degree range in due time.  This causes throttling, ruining the experience I already resent for its underpowered GPU.  On top of this, the unnecessarily constricted breathing apparatus strapped to this poor motherboard is causing a massive buildup of heat, both above the keyboard (no big deal) and on the entire bottom side (yikes).   For this to be this expensive, underpowered, and almost overheating is too many flaws for one device to have.  \nYou see, I don't really recall asking for a macbook air that could game, but here we are.  Thinner than a macbook pro for absolutely no one's benefit.\n","rating value":3.6976744186},{"name":"Samuel165\n","description":"The zephrus G16 is a powerhouse of the computer. the only thing you have to be careful is the computer out the box is garbage. The Asus software that’s preloaded slows down the computer and it gets very hot, even sometimes within 5 min too hot to keep on your lap.\n\nThe solution is to uninstall all of the Asus preloaded software and install G-helper. the laptop then becomes super quiet and super cool. and the battery life is extended by a lot. once plugged in the cpu will give you maximum power and when unplugged it will use igpu\n","rating value":3.0},{"name":"Antmo\n","description":"Great laptop! I can't say enough how much I love this piece of tech. I currently use it in work settings and no one pointed out that it was a gaming computer. Also, the battery life can be really good for those 2 hour meetings.\n","rating value":3.0},{"name":"birdhunter14\n","description":"This is a great premium laptop. I have never personally owned a laptop that feels this sturdy and just the overall package is so complete. From the screen to the speakers to the performance it is all top notch. I definitely recommend if you are on the fence to give it a try.\n","rating value":3.8571428571},{"name":"Collin\n","description":"Best laptop I’ve ever owned, stays cool on turbo and runs every game maxed out at 1600p, got it on sale for the same price as the 4080\n","rating value":5.0},{"name":"MadHatter0101\n","description":"Almost perfect. I would of preferred the AMD Ryzen AI CPU, but if you want the 4080 or 4090 rtx you are stuck with Intel. This is a really good Intel CPU and the Arc GPU is amazing. \n\nI would of given it a perfect score, but it should of came with 64gb of ram or at least come with CAMM so you can upgrade for the price.\n\nThen next the 4090 is the max q version and they don't list it as that. The issue is that's 10-20 percent slower because of the power power max q. I would of love the 175 watt GPU and not the 125 max q for $3300.\n\nLast is the Best buy problem. You can't get the affordable Asus extended warranty. It's $200 for 3 years with accidental if you could get it through Asus. Asus won't let you get it and forces you to buy Best buys $400-$500 warranty which takes 3 times as long to fix and no where near the quality.\n","rating value":3.9090909091},{"name":"Derrek\n","description":"This checks all my boxes as far as laptops go. I purchased this machine for mechanical engineering at university. it's got a centered keyboard, OLED 240 Hz display which looks like butter, an amazing GPU with a vapor chamber, and a sleek design that doesn't have a super in your face gamer aesthetic.\n","rating value":5.0},{"name":"BMW74\n","description":"The ASUS ROG Zephyrus G16 4090 (2024) is a fantastic choice for any gamer and creative professionals seeking a powerful, portable machine with a stunning display. If you have the budget and prioritize performance and visuals, this laptop is it. However, you might consider alternative options if you're more budget-conscious or need longer battery life. They make 4070 and 4080 models for the G16 (2024). At 4.30lbs and 0.59\", this is a great travel companion.\n","rating value":5.0},{"name":"JonatasA\n","description":"Great Laptop and the design is amazing. Screen beautiful and sound is also pretty good.\n","rating value":5.0},{"name":"MehmetEl\n","description":"Actually, I bought this product because of its Battery life, however, it does not survive more than 4.5 hours under medium load which is surfing on the internet and at 80% brightness.\nAdditionally, it gets very hot sometimes.\nOther than that, the Oled Screen is great, the keyboard is purity, easy to use, and light weight if you compare it with the gaming laptops.\n","rating value":1.0},{"name":"exocetis\n","description":"OLED display is simply gorgeous. I can't go back to IPS after experiencing OLED. This laptop is impressively slim and the build quality is at par with Macbooks. Caveats- 4090 performance is lower by almost 25% as compared to other full power 4090 laptops. 32GB RAM is non-upgradeable, which can be a problem for memory intensive apps. To improve performance on battery, make the following changes-\n1. Disable Hyperthreading via BIOS\n2. Remove ASUS Armory crate and install Ghelper. Remove all ASUS background services. Use the silent profile and disable the nvidia gpu\n3. Remove junk Windows services with Chris Titus' tool.\nThis reduces power consumption to ~17W on battery. Still 5 W higher than a Macbook, but that's the tradeoff for using x86 laptops.\n","rating value":5.0},{"name":"Dish2020\n","description":"Excellent computer graphics and better performance than MacBook Pro m3 pro chipset\n","rating value":5.0},{"name":"Anonymous\n","description":"Pros: OLED display with VRR looks incredible, GPU is top notch, chassis is nice. Vapor chamber, 2TB of storage, and 32GB of ram are all nice upgrades over the lower-tier models.\n\nCons: The CPU on this thing runs way too hot. I have had my laptop shutdown while gaming multiple times in the first week of owning it. Could just be bad luck with ASUS applying the liquid metal incorrectly at the factory, but if you look it up online, plenty of other people say the G16 specifically runs super hot. Also, Armoury Crate is not great, but removing it and replacing it with G-Helper takes 10 minutes.\n","rating value":2.7142857143},{"name":"Nick1963\n","description":"This device has excellent audio, video, and typing fidelity. It serves as a great back up to a full desktop device as it has an amazing display and great speakers as if it were a full desktop. The only drawback I can think of is the power draw for the 4090 is lower than compared to some competing models but it doesn't significantly lack behind on performance but it makes up for this in quality.\n","rating value":5.0},{"name":"Lilshaun\n","description":"One of the best laptops you can buy period. Not only is this machine powerful to run any modern AAA title you throw at it, but when you don't want to game, you have one of the best ultrabooks in the market. Absolutely worth it, though I'd wait for the 4080 to be available as that one is better value than the 4090 model.\n","rating value":4.4285714286},{"name":"PalmBlock\n","description":"Is it going to blow the doors off some other, much heavier, gaming laptops? No. But those are desktop replacements and this is an ultra book with ultra graphics power. It’s basically a windows MacBook Pro with better graphics, screen is great, cpu and gpu are fast, handles heat extremely well as long as it’s raised and is perfectly fine flat on the desk in productivity silent mode. Around 16000 timespy score without sounding like a lawnmower. Just a great at what it is: a real portable 1440p ultra ray traced everything gaming machine that can push 4k high ray traced when you need it.\n","rating value":3.6666666667},{"name":"MilesP\n","description":"Great laptop.\nPlays all the games I throw at it.\nGets hot but I cant see that being an issue, as I dont keep it on my lap.\n\nBattery life is rough if you are doing anything serious, but with its power draw, its expected.\n","rating value":4.0},{"name":"CGEE\n","description":"Amazing laptop. I’m not sure there’s a better form factor for the amount of power you get from this machine. If you’re looking for uncompromised performance then look no further. It eats a lot of energy at the top settings but you can dial it back as needed.\n","rating value":3.6666666667},{"name":"KevinS\n","description":"The screen is spectacular ran some movies and games and the visuals and performance are top notch. Overall build quality is great. What the reviewers say about the hinge is accurate and ideally could be a little tighter but I have this laptop on a stand hooked up to a 4K monitor so isn't too big of an issue for me. Overall very satisfied.\n","rating value":3.0},{"name":"Brian\n","description":"This gaming laptop PC rocks, the computer and video are amazing. I have put quite a few games and simulators thru the ringer on this laptop and It just asks for more. Can’t say enough about the Best Buy staff that assisted on the technical side and advice, they were well trained and very good and answering all of my questions and I had many.\n\nThanks Best Buy for a GREAT experience!\n","rating value":4.5},{"name":"ClaudioI\n","description":"Best laptop and great performance to play any game.\n","rating value":5.0},{"name":"Jackson\n","description":"Upgrading from previous zephryus that had a 3070.  Love the oled screen, threw in a 4tb samsung 990 pro in the second slot.  I use for work and play.  I like it because it’s s light and I can easily throw it in my backpack and go anywhere with it.  32 gb of ram runs way better than my old 16 gb.  I just mainly play call of duty on extreme settings and runs it just fine.\n","rating value":4.2},{"name":"Jonathan\n","description":"Great laptop for any games thrown at it. It does get a bit hot, but that is a sacrifice for such a great design. The OLED panel is insane and makes me want to look at the laptop more and more.\n","rating value":5.0},{"name":"AliP\n","description":"I appreciate its thinness and lightness and its understated design.\nThe display looks great and speakers sounds very good.\nMy only issue with it is the trackpad noise when you click or even tap to click. It seems there is an airgap between the glass and the switch. Also based on comments in forums it is quite a common issue.\n","rating value":5.0},{"name":"DaveE\n","description":"What a great laptop...the ROG Zephyrus G16 is such a well-put-together portable package that's thin, light, and powerful. Great buy!\n","rating value":1.0},{"name":"Gonz\n","description":"Great design, feels premium, the battery does not completely sucks, lightweight and portable.\n","rating value":1.0},{"name":"Kchen\n","description":"Very good laptop but cooling and battery performance is worse than I expected. Also it is very hard to set it up working properly in Linux environment.\n","rating value":5.0},{"name":"SixSheep\n","description":"Good performance. easy to carry, good-looking screen.\nIf you want 16GB VRAM with a low weight, you have to choose this one.\n","rating value":5.0},{"name":"GrzegorzP\n","description":"A powerful machine, but under heavy load the keyboard heats up quite a bit.\n","rating value":0.0},{"name":"FranciscoL\n","description":"Slim and powerful 16 inch laptop, brigth and crisp display, i think i would pewfere another usb type a instwad of the hdmi\n","rating value":0.0},{"name":"MoeMax\n","description":"Love the product so premium. But unfortunately when I got it I travelled out of the US for work to realize that the left ctrl button is physically sticky even though it does register after a stronger press. I paid so much for this and it is kinda disappointing getting this! I waited for so long for it and since I travelled out of USA I am stuck with this not knowing what to do. Could have been an easy 5 but!\n","rating value":3.0},{"name":"Robbo\n","description":"My new ASUS ROG Zephyrus G16 has met my expectations!\nThe people at best buy we great and Marissa gets 10 stars!\n","rating value":3.0},{"name":"JCBO\n","description":"Fantastic computer with sleek and lightweight desigb\n","rating value":0.0},{"name":"VvVv\n","description":"A very powerful laptop with a bright and very pleasant looking screen. However, can get quite noisy and hot in performance mode. Also, no LAN port - that was a deal breaker for me.\n","rating value":5.0},{"name":"MarcC\n","description":"Excellent performing laptop! Must buy! Great for gaming and school work.\n","rating value":1.0},{"name":"Cracko298\n","description":"Awesome Laptop, the best ive ever used and probably will ever use. Alumium chasis, and 240hz OLED is awesome, i would reccomend this laptop at its asking price of $3200.\n","rating value":5.0},{"name":"AngelO\n","description":"Love this laptop, sound is awesome but the screen is even better.\n","rating value":5.0},{"name":"jollib\n","description":"So powerful in a small package. Worth every penny spent\n","rating value":5.0},{"name":"Anonymous\n","description":"Asus always meet my expectations, and this laptop is not gonna be the exemption, wonderful screen and amazing performance, I used for gaming and 3d modeling and has never been slow for me\n","rating value":4.2},{"name":"PhillipO\n","description":"Thin, amazing graphics and beautiful screen display!\n","rating value":5.0},{"name":"Phone123\n","description":"So far so good, the only problem is that it does bot have a touch screen. It needs this.\n","rating value":5.0},{"name":"AdrianneR\n","description":"Ordered this laptop and was excited by the fact that there was a 4090 in such a beautiful chassis. Sadly, no matter the settings, the laptop would consistently drop FPS and stutter even when on maximum performance modes. \n\nThe 4090 seems to be a bad match for the Intel Core Ultra CPU, a less powerful but more battery efficient processor. A CPU bottleneck could explain the issues I had, as I returned my original unit for another and issues persisted. Benchmarks were great, real world performance wasn't what I'd expect from a $3k computer.\n\nSwapping it for the 4080 version, hoping for better results...\n","rating value":3.6666666667},{"name":"SarkisB\n","description":"Great laptop battery, OLED,  light weight, 4090 GPU \nSo really can't go wrong with this device\n","rating value":1.0},{"name":"ErikS\n","description":"Excellent purchase. This is a beast of a machine. Response time is practically nothing. Plus it is lightweight and well made.\n","rating value":2.3333333333},{"name":"SebastianM\n","description":"I have not used it for that long but its a great laptop\n","rating value":3.0},{"name":"LaptopCollector\n","description":"Anything beyond web browsing and this one heated up and is too hot to touch except on the keyboard.  I really wanted to love this laptop because of the design and OLED.\n\nJust wasnt meant to be.\n","rating value":3.6666666667},{"name":"Anonymous\n","description":"The perfect laptop for me, now I will be able to play Warzone without so much lag and at the same time promote my business as another hobby\n","rating value":5.0},{"name":"Thomas\n","description":"I really wanted to like this laptop due to OLED and thin profile. During the two days I had it, I experienced poor, glitchy gaming performance and overheating (even in Armoury Crate's \"performance\"\/balanced mode). Perhaps I had a defective unit?\n","rating value":1.0},{"name":"Reis\n","description":"Great, Just in love with my ny computer. So easy to usr, phenomenal.\n","rating value":5.0},{"name":"JuanM\n","description":"Great laptop, super fast and with all the best components in the market\n","rating value":5.0},{"name":"Nate\n","description":"Had to return the laptop twice due to constant crashes\/blue screens on the first one and broken touchpad on the second. Now the third will not launch any programs or games that require the GPU. There seems to be a recognized problem with RTX 40 notebook cards and nvidia optimus and there hasnt been any word on fixes for the past year. This causes the screen to go black until you hard reboot the laptop. Do not buy this until these issues are fixed. Save yourself the time and money\n","rating value":2.7142857143},{"name":"Aravind\n","description":"To be Honest the build quality is excellent but performance is very bad for 3.2k laptop .\nCons\n1. Does not handle long gaming sessions well (Over heats and game starts lagging). \n2. when connected to a monitor it cannot handle , 240 hz displays . It simply shutters with a 4090 graphics  and ultra 9 processor . Tried all the display settings but no help\n3. Network Adapter needs a buff. Cannot reach any wifi signal even though in range . Had to buy a ethernet cable for stable gaming . \n4. Haven't tried any editing softwares . Might perform well with those. \nMight be a Faulty laptop from the start ... Will return it as soon as possible. \nThanks\n","rating value":3.0},{"name":"yeety\n","description":"Good laptop, went with the 4080 version instead though\n","rating value":0.0},{"name":"Lilith\n","description":"Runs a little warm and a little loud, but it's not bad given the power and form factor.\n","rating value":1.0},{"name":"Anonymous\n","description":"First day owning this 4090 laptop I couldn’t get any games to play without it overheating and shutting off on its own. Don’t bother with one of these. I sent mine back day 1. \n\nTry a Lenovo or something that has actual airflow.\n\nThe one star is for the screen and the fact that you could cook some food on the laptop with how hot it gets.\n","rating value":5.0},{"name":"Vynter\n","description":"Design and Build Quality The ASUS Zephyrus G16 2024 is a premium laptop with excellent craftsmanship. It’s like the James Bond of laptops - sleek, stylish, and always ready for action. It’s surprisingly slim given the hardware inside. The build quality is finally on par with that of a MacBook Pro, which is a significant improvement and a testament to ASUS’s commitment to quality.\n\nDisplay The laptop comes with a 16-inch OLED display with a refresh rate of 240Hz, which offers vibrant colors and sharp details. It’s so smooth, it makes both games and regular tasks feel like butter sliding on a hot pan. It’s so good, you might forget you’re looking at a screen and not a window into another world. The screen is sturdy and can be opened with one hand, a feature that is often overlooked but greatly appreciated.\n\nKeyboard The keyboard on the ASUS Zephyrus G16 2024 is very nice, providing a comfortable typing experience. However, it only has one RGB zone. Having more than one RGB zone would allow for cool effects when typing, adding a bit of flair to your gaming sessions.\n\nPerformance: The ASUS Zephyrus G16 2024 is equipped with an Intel Core Ultra 9 185H processor, 32 GB of LPDDR5x RAM, and Nvidia RTX 4090 graphics. It’s like having a sports car engine in a family sedan. However, the performance of the RTX 4090 is somewhat limited in this thinner chassis. \n\nInputs and IO: The laptop has punchy speakers that deliver high-quality audio, making it a joy for music lovers and gamers alike. However, it lacks built-in media keys, which is a surprising omission for a laptop this big. It’s like having a state-of-the-art home theater system but no remote to control it. For its premium price point, it’s also missing Wi-Fi 7. However, the good news is that the Wi-Fi card can be upgraded, so you’re not stuck with Wi-Fi 6E forever.\n\nBattery Life: The laptop comes with a 90Wh battery that offers good runtimes. But with a 4090 keep expectations within reason.\n\nPrice: The laptop is priced at around $3299, which is a bit pricey, especially for the 4090 version. But hey, who said being the coolest kid on the block was cheap?\n\nGaming Experience: For serious gaming, a chill mat is highly recommended to keep the laptop cool during intense gaming sessions. It’s like giving your laptop a personal air conditioner.\n\nFuture Potential: With the upcoming addition of Copilot+ functionality for Nvidia GPUs by Nvidia and Microsoft, this laptop has the potential to become a powerful tool for AI-related tasks. It’s like giving a cheetah a jetpack.\n\nVerdict: The ASUS Zephyrus G16 2024 is a high-performance gaming laptop. It’s slim, sleek, and fantastic to use as a daily driver. However, with the RTX 4090 onboard, it’s got a lot of high-end hardware. The inclusion of Wi-Fi 7 would make it even more future-proof and provide users with a better value for their investment.\n","rating value":4.0},{"name":"ZachG\n","description":"No use burying the lede on this one...this is absolutely, without a doubt, the best laptop I have ever used.\n\nLet's talk performance: In Adobe Audition, I had 24 concurrent audio files open and playing in a multitrack session with not a single hiccup or stutter. Nothing I threw at this device in Premiere slowed it down - multiple files, graphics, and animations, and full speed ahead with everything. In Media Encoder, I was able to render a 3 minute 1080p video in 5 seconds. FIVE SECONDS! A 60 minute video rendered out in 6 and a half minutes. If you're considering this device as a media production laptop, you absolutely will be happy.\n\nNow for gaming? I am blown away. I've only had this laptop for a few days, but I have already played Starfield, No Man's Sky, Skyrim: Anniversary Edition, Mass Effect: Legendary Edition, and Mass Effect: Andromeda - all on their highest possible settings without a single stutter. Seeing some of these games at 240Hz for the first time was literally breath-taking.\n\nNow for the hardware - starting with that 240Hz screen...it's gorgeous. Being OLED as well, the color contrast is fantastic, the response time is great, the bezels are small, 16\" is more than enough to have a great gaming experience without needing to hook up a monitor (which you can easily do, by the way, since this laptop actually has an HDMI port - which are becoming an endangered species). The speakers are also fantastic - upward firing and quite large, they produce a relatively full range of sound. They are laptop speakers though, so you will get a better experience with headphones (but the difference is not as stark as it is on most laptops). The keyboard is great as well; keys are well spaced, the extra four \"M\" keys above the keyboard are very useful, and each key is subtly cupped, making for a great typing experience. The trackpad is fine, but it actually might be *too* big; it's pretty easy to accidentally rest your palms on the top corners while playing a game - but it performs well, and the extra real estate is great for when you're getting some work done. The build quality is also top-notch - fully metal, no bending or creaking, ample fan ports for keeping things cool, and a neat little quirk with the \"slash\" lighting on the lid.\n\nOne other thing about this physical hardware that I am very grateful for is that it looks like a normal laptop. This is actually the first \"gaming\" laptop I've ever used, mostly because all of the other computers in this category look like they were designed for middle school children with all the flashing lights and gaudy design choices. Whereas with this Zephyrus, you could take this to work or the coffee shop and you would blend right in.\n\nOne last standout feature to me is the included ASUS Software called \"Armoury Crate.\" It is super intuitive, and allows great control of features like CPU & GPU performance, lighting, fan speed, and other configurations. As someone who is using a \"gaming\" laptop for the first time, this software is easy to use and understand, and I am grateful.\n\n...Nothing is perfect though, right? There is one downside to this laptop: the fan. It's loud. Very loud. Which isn't a *bad* thing...it's actually a very necessary thing to allow the incredible performance that this laptop can put out...but it is something to be aware of. With this CPU and the RTX 4090 inside, things need to stay cool. I generally have headphones on when I'm working or playing so I don't really notice it, but it is something to be aware of.\n\nIf you can't tell - I love this laptop. I know the cost is high, but it is absolutely, 100% worth it if you care about top quality performance. You will not be disappointed.\n","rating value":3.8333333333}]